Audio/Video Transport WG                                      S. Wenger 
Internet Draft                                               Y.-K. Wang 
Intended status: Standards track                                  Nokia 
Expires: March 2009                                          T. Schierl 
                                                         Fraunhofer HHI 
                                                       A. Eleftheriadis 
                                                                  Vidyo 
                                                     September 26, 2008 
                                    
 
 
                                      
                     RTP Payload Format for SVC Video 
                       draft-ietf-avt-rtp-svc-14.txt 


    

Status of this Memo 

   By submitting this Internet-Draft, each author represents that any 
   applicable patent or other IPR claims of which he or she is aware 
   have been or will be disclosed, and any of which he or she becomes 
   aware will be disclosed, in accordance with Section 6 of BCP 79. 

   Internet-Drafts are working documents of the Internet Engineering 
   Task Force (IETF), its areas, and its working groups.  Note that 
   other groups may also distribute working documents as Internet-
   Drafts. 

   Internet-Drafts are draft documents valid for a maximum of six 
   months and may be updated, replaced, or obsoleted by other documents 
   at any time.  It is inappropriate to use Internet-Drafts as 
   reference material or to cite them other than as "work in progress." 

   The list of current Internet-Drafts can be accessed at 
   http://www.ietf.org/ietf/1id-abstracts.txt 

   The list of Internet-Draft Shadow Directories can be accessed at 
   http://www.ietf.org/shadow.html 

   This Internet-Draft will expire on March 26, 2009. 

Copyright Notice 

   Copyright (C) The IETF Trust (2008). 

 
 
 
 
Wenger, et al           Expires March 26, 2009                 [Page 1] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

Abstract 

   This memo describes an RTP payload format for Scalable Video Coding 
   (SVC) as defined in_Annex G of ITU-T Recommendation H.264, which is 
   technically identical to Amendment 3 of ISO/IEC International 
   Standard 14496-10.  The RTP payload format allows for packetization 
   of one or more Network Abstraction Layer (NAL) units in each RTP 
   packet payload, as well as fragmentation of a NAL unit in multiple 
   RTP packets.  Furthermore, it supports transmission of an SVC stream 
   over a single as well as multiple RTP sessions.  For single-session 
   transmission the packetization modes of RFC 3984 are used.  For 
   multi-session transmission four different modes are defined in this 
   memo.  The modes differ depending on whether the SVC data are 
   allowed to be interleaved, i.e., to be transmitted in an order 
   different than the intended decoding order, and they also differ in 
   the mechanisms provided in order to recover the correct decoding 
   order of the NAL units across the multiple RTP sessions.  
   Specifically, decoding order recovery is performed using either 
   timestamp alignment or Cross-Session Decoding Order Numbers (CS-
   DON), although in one of the modes both schemes are used in order to 
   allow receivers to use their preferred method.  The multi-session 
   transmission modes use the packetization modes defined in RFC 3984 
   as each individual session still uses a packetization mode defined 
   in RFC 3984.  The packetization modes defined in RFC 3984 are 
   slightly extended such that the three new NAL unit types defined in 
   this memo can be included in the RTP packet streams.  The payload 
   format defines a new media subtype name "H264-SVC", but is still 
   backwards compatible to RFC 3984 since the base layer, when 
   encapsulated in its own RTP stream, must use the H.264 media subtype 
   name ("H264") and the packetization method specified in RFC 3984.  
   The payload format has wide applicability in videoconferencing, 
   Internet video streaming, and high bit-rate entertainment-quality 
   video, among others.  

Table of Contents 

   Status of this Memo...............................................1 
   Copyright Notice..................................................1 
   Abstract..........................................................2 
   Table of Contents.................................................2 
   1 . Introduction..................................................4 
      1.1 . The SVC Codec............................................6 
         1.1.1 . Overview............................................6 
         1.1.2 . Parameter Sets......................................8 
         1.1.3 . NAL Unit Header.....................................9 
      1.2 . Overview of the Payload Format..........................12 
         1.2.1 Design Principles....................................12 
 
 
Wenger, et al           Expires March 26, 2009                 [Page 2] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

         1.2.2 Transmission Modes and Packetization Modes...........12 
         1.2.3 New Payload Structures...............................14 
   2 . Conventions..................................................15 
   3 . Definitions and Abbreviations................................16 
      3.1 Definitions...............................................16 
         3.1.1 Definitions from the SVC Specification...............16 
         3.1.2 Definitions Specific to This Memo....................18 
      3.2 Abbreviations.............................................21 
   4 . RTP Payload Format...........................................21 
      4.1 RTP Header Usage..........................................21 
      4.2 NAL Unit Extension and Header Usage.......................22 
         4.2.1 NAL Unit Extension...................................22 
         4.2.2 NAL Unit Header Usage................................23 
      4.3 Payload Structures........................................24 
      4.4 Transmission Modes........................................27 
      4.5 Packetization Modes.......................................27 
         4.5.1 Packetization Modes for Single-Session Transmission..27 
         4.5.2 Packetization Modes for Multi-Session Transmission...28 
      4.6 Single NAL Unit Packets...................................32 
      4.7 Aggregation Packets.......................................32 
         4.7.1 Non-Interleaved Multi-Time Aggregation Packets (NI-
         MTAPs).....................................................32 
      4.8 Fragmentation Units (FUs).................................34 
      4.9 Payload Content Scalability Information (PACSI) NAL Unit..35 
      4.10 Empty NAL unit...........................................43 
      4.11 Decoding Order Number (DON)..............................43 
         4.11.1 Cross-Session DON (CS-DON) for Multi-Session 
         Transmission...............................................44 
   5 . Packetization Rules..........................................45 
      5.1 Packetization Rules for Single-Session Transmission.......45 
      5.2 Packetization Rules for Multi-Session Transmission........46 
         5.2.1 NI-T/NI-TC Packetization Rules.......................47 
         5.2.2 NI-C/NI-TC Packetization Rules.......................49 
         5.2.3 I-C Packetization Rules..............................51 
         5.2.4 Packetization Rules for Non-VCL NAL Units............51 
         5.2.5 Packetization Rules for Prefix NAL Units.............51 
   6 . De-Packetization Process.....................................51 
      6.1 De-Packetization Process for Single-Session Transmission..51 
      6.2 De-Packetization Process for Multi-Session Transmission...51 
         6.2.1 Decoding Order Recovery for the NI-T and NI-TC Modes.52 
            6.2.1.1 Informative Algorithm for NI-T Decoding Order 
            Recovery within an Access Unit..........................56 
         6.2.2 Decoding Order Recovery for the NI-C, NI-TC and I-C 
         Modes......................................................58 
   7 . Payload Format Parameters....................................60 
      7.1 Media Type Registration...................................61 
      7.2 SDP Parameters............................................71 
 
 
Wenger, et al           Expires March 26, 2009                 [Page 3] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

         7.2.1 Mapping of Payload Type Parameters to SDP............71 
         7.2.2 Usage with the SDP Offer/Answer Model................72 
         7.2.3 Usage with Multi-Source Transmission.................77 
         7.2.4 Usage in Declarative Session Descriptions............77 
      7.3 Examples..................................................78 
         7.3.1 Example for Offering A Single SVC Session............78 
         7.3.2 Example for Offering Session Multiplexing............78 
      7.4 Parameter Set Considerations..............................79 
   8 . Security Considerations......................................79 
   9 . Congestion Control...........................................80 
   10 . IANA Consideration..........................................81 
   11 . Informative Appendix: Application Examples..................81 
      11.1 Introduction.............................................81 
      11.2 Layered Multicast........................................81 
      11.3 Streaming................................................82 
      11.4 Videoconferencing (Unicast to MANE, Unicast to Endpoints)83 
      11.5 Mobile TV (Multicast to MANE, Unicast to Endpoint).......83 
      11.6 SSRC Multiplexing........................................84 
   12 . References..................................................85 
      12.1 Normative References.....................................85 
      12.2 Informative References...................................86 
   13 . Authors' Addresses..........................................87 
   Intellectual Property Statement..................................88 
   Disclaimer of Validity...........................................88 
   Copyright Statement..............................................89 
   Acknowledgement..................................................89 
   14 . Open Issues.................................................89 
   15 . Changes Log.................................................89 
    
1. Introduction 

   This memo specifies an RTP [RFC3550] payload format for the Scalable 
   Video Coding (SVC) extension of the H.264/AVC video coding standard.  
   SVC is specified in Amendment 3 to ISO/IEC 14496 Part 10 [MPEG4-10], 
   and equivalently in Annex G of ITU-T Rec. H.264 [H.264].  In this 
   memo, unless explicitly stated otherwise, "H.264/AVC" refers to the 
   specification of [H.264] excluding Annex G. 

   SVC covers the entire application range of H.264/AVC, from low 
   bitrate mobile applications, to HDTV broadcasting, and even Digital 
   Cinema that requires nearly lossless coding and hundreds of Mbps.  
   The scalability features that SVC adds to H.264/AVC enable several 
   system-level functionalities related to the ability of a system to 
   adapt the signal to different system conditions with no or minimal 
   processing.  The adaptation relates both to the capabilities of 
   potentially heterogeneous receivers (differing in screen resolution, 
   processing speed, etc.), as well as differing or time-varying 
 
 
Wenger, et al           Expires March 26, 2009                 [Page 4] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   network conditions.  The adaptation can be performed at the source, 
   the destination, or in intermediate media-aware network elements 
   (MANEs).  The payload format specified in this memo exposes these 
   system-level functionalities so that system designers can take 
   direct advantage of these features. 

        Informative note: Since SVC streams contain, by design, a sub-
        stream that is compliant with H.264/AVC, it is trivial for a 
        MANE to filter the stream so that all SVC-specific information 
        is removed.  This memo, in fact, defines a signaling parameter 
        ("avc-ready", Section 7.2) that indicates whether or not the 
        stream can be converted to one compliant to RFC 3984 [RFC3984] 
        simply by simply eliminating RTP packets.  

   This memo defines two basic modes for transmission of SVC data, 
   single session-transmission (SST) and multi session-transmission 
   (MST).  In SST, a single RTP session is used for the transmission of 
   all scalability layers comprising an SVC bitstream, whereas in MST 
   the scalability layers are transported on different RTP sessions.  
   In SST, packetization is a straightforward extension of RFC 3984.  
   For MST four different modes are defined in this memo.  They differ 
   on whether or not they allow interleaving, i.e., transmitting 
   Network Abstraction Layer (NAL) units in an order different than the 
   decoding order, and by the technique used to effect inter-session 
   NAL unit decoding order recovery. Decoding order recovery is 
   performed using either inter-session timestamp alignment [RFC3550] 
   or Cross-Session Decoding Order Numbers (CS-DON).  One of the MST 
   modes supports both decoding order recovery techniques, so that 
   receivers can select their preferred technique.  More details can be 
   found in Section 1.2.2. 

   This memo further defines three new NAL unit types.  The first type 
   is the Payload Content Scalability Information (PACSI) NAL unit, 
   which is used to provide an informative summary of the scalability 
   information of the data contained in an RTP packet, as well as 
   ancillary data (e.g., CS-DON values).  The second and third new NAL 
   unit types are the Empty NAL unit and the Non-Interleaved Multi-time 
   Aggregation Packet (NI-MTAP) NAL unit. The Empty NAL unit is used to 
   ensure inter-session timestamp alignment required for decoding order 
   recovery in MST.  The NI-MTAP is used as a new payload structure 
   allowing the grouping of NAL units of different time instances in 
   decoding order. More details about the new packet structures can be 
   found in Section 1.2.3. 

   This memo also defines the signaling support for SVC transport over 
   RTP, including a new media subtype name (H264-SVC). 

 
 
Wenger, et al           Expires March 26, 2009                 [Page 5] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   An overview of the SVC codec and the payload is given in the 
   remainder of this section.  

1.1. The SVC Codec 

1.1.1. Overview 

   SVC defines a coded video representation in which a given bitstream 
   offers representations of the source material at different levels of 
   fidelity (hence the term "scalable").  Scalable video coding 
   bitstreams, or scalable bitstreams, are constructed in a pyramidal 
   fashion: the coding process creates bitstream components that 
   improve the fidelity of hierarchically lower components. 

   The fidelity dimensions offered by SVC are spatial (picture size), 
   quality (or Signal-to-Noise Ratio - SNR), as well as temporal 
   (pictures per second).  Bitstream components associated with a given 
   level of spatial, quality, and temporal fidelity are identified 
   using corresponding parameters in the bitstream: dependency_id, 
   quality_id, and temporal_id (see also Section 1.1.3).  The fidelity 
   identifiers have integer values, where higher values designate 
   components that are higher in the hierarchy.  It is noted that SVC 
   offers significant flexibility in terms of how an encoder may choose 
   to structure the dependencies between the various components.  
   Decoding of a particular component requires the availability of all 
   the components it depends upon, either directly, or indirectly.  An 
   operation point of an SVC bitstream consists of the bitstream 
   components required to be able to decode a particular dependency_id, 
   quality_id, and temporal_id combination. 

   SVC maintains the bitstream organization introduced in H.264/AVC.  
   Specifically, all bitstream components are encapsulated in Network 
   Abstraction Layer (NAL) units which are organized as Access Units 
   (AU).  An AU is associated with a single sampling instance in time.  
   A subset of the NAL unit types correspond to the Video Coding Layer 
   (VCL), and contain the coded picture data associated with the source 
   content.  Non-VCL NAL units carry ancillary data that may be 
   necessary for decoding (e.g., parameter sets as explained below), or 
   that facilitate certain system operations but are not needed by the 
   decoding process itself.  Coded picture data at the various fidelity 
   dimensions are organized in slices.  Within one AU, a coded picture 
   of an operation point consists of all the coded slices required for 
   decoding up to the particular combination of dependency_id and 
   quality_id values at the time instance corresponding to the AU. 

   It is noted that the concept of temporal scalability is already 
   present in H.264/AVC, as profiles defined in Annex A of [H.264] 
 
 
Wenger, et al           Expires March 26, 2009                 [Page 6] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   already support it.  Specifically, in H.264/AVC the concept of sub-
   sequences has been introduced to allow optional use of temporal 
   layers through Supplemental Enhancement Information (SEI) messages.  
   SVC extends this approach by exposing the temporal scalability 
   information using the temporal_id parameter, alongside (and unified 
   with) the dependency_id and quality_id values that are used for 
   spatial and quality scalability, respectively.  For coded picture 
   data defined in Annex G of [H.264] this is accomplished by using a 
   new type of NAL unit, namely coded slice in scalable extension NAL 
   unit (type 14), where the fidelity parameters are part of its 
   header.  For coded picture data that follow H.264/AVC, and to ensure 
   compatibility with existing H.264/AVC decoders, another new type of 
   NAL unit, namely prefix NAL unit (type 20), has been defined to 
   carry this header information. SVC additionally specifies a third 
   new type of NAL unit, namely subset sequence parameter set NAL unit 
   (type 15), to contain sequence parameter set information for quality 
   and spatial enhancement layers.  All these three newly specified NAL 
   unit types (14, 15 and 20) are among those reserved in H.264/AVC, 
   and are to be ignored by decoders conforming to one or more of the 
   profile specified in Annex A of [H.264]. 

   Within an AU, the VCL NAL units associated with a given 
   dependency_id and quality_id are referred to as a "layer 
   representation".  The layer representation corresponding to the 
   lowest values of dependency_id and quality_id (i.e., zero for both) 
   is compliant by design to H.264/AVC.  The set of VCL and associated 
   non-VCL NAL units across all AUs in a bitstream associated with a 
   particular combination of values of dependency_id and quality_id, 
   and regardless of the value of temporal_id, is conceptually a 
   scalable layer.  For backwards compatibility with H.264/AVC, it is 
   important to differentiate, however, whether or not SVC-specific NAL 
   units are present in a given bitstream or not.  This is particularly 
   important for the lowest fidelity values in terms of dependency_id 
   and quality_id (zero for both), as the corresponding VCL data are 
   compliant to H.264/AVC, and may or may not be accompanied by 
   associated prefix NAL units.  This memo therefore uses the term "AVC 
   base layer" to designate the layer that does not contain SVC-
   specific NAL units, and "SVC base layer" to designate the same layer 
   but with the addition of the associated SVC prefix NAL units.  Note 
   that the SVC specification uses the term "base layer" for what in 
   this memo will be referred to as "AVC base layer".  Similarly, it is 
   also important to be able to differentiate, within a layer, the 
   temporal fidelity components it contains.  This memo uses the term 
   "T0" to indicate, within a particular layer, the subset that 
   contains the NAL units associated with temporal_id equal to 0. 


 
 
Wenger, et al           Expires March 26, 2009                 [Page 7] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   The term "layer" is used in various contexts in this memo.  For 
   example, in the terms "Video Coding Layer" and "Network Abstraction 
   Layer" it refers to conceptual organization levels.  When referring 
   to bitstream syntax elements such as block layer or macroblock 
   layer, it refers to hierarchical bitstream structure levels.  When 
   used in the context of bitstream scalability, e.g., "AVC base 
   layer", it refers to a level of representation fidelity of the 
   source signal with a specific set of NAL units included.  The 
   correct interpretation is supported by providing the appropriate 
   context. 

   SNR scalability in SVC is offered in two different ways.  In what is 
   called Coarse-Grained Scalability (CGS), scalability is provided by 
   including or excluding a complete layer when decoding a particular 
   bitstream.  In contrast, in Medium-Grained Scalability (MGS), 
   scalability is provided by selectively omitting the decoding of 
   specific NAL units belonging to MGS layers.  The selection of the 
   NAL units to omit can be based on fixed length fields present in the 
   NAL unit header (see also Sections 1.1.3 and 4.2). 

1.1.2. Parameter Sets 

   SVC maintains the parameter sets concept in H.264/AVC and introduces 
   a new type of sequence parameter set, referred to as subset sequence 
   parameter set [H.264].  Subset sequence parameter sets have NAL unit 
   type equal to 15, which is different from the NAL unit type value 
   (7) of sequence parameter sets.  VCL NAL units of NAL unit type 1 to 
   5 must only (indirectly) refer to sequence parameter sets, while VCL 
   NAL units of NAL unit type 20 must only (indirectly) refer to subset 
   sequence parameter sets.  The references are indirect because VCL 
   NAL units refer to picture parameter sets (in their slice header), 
   which in turn refer to regular or subset sequence parameter sets.  
   Subset sequence parameter sets use a separate identifier value space 
   than sequence parameter sets. 

   In SVC, coded picture data from different layers may use the same or 
   different sequence and picture parameter sets.  Let the variable 
   DQId be equal to dependency_id * 16 + quality_id.  At any time 
   instant during the decoding process there is one active sequence 
   parameter set for the layer representation with the highest value of 
   DQId and one or more active layer SVC sequence parameter set(s) for 
   layer representations with lower values of DQId.  The active 
   sequence parameter set or an active layer SVC sequence parameter set 
   remains unchanged throughout a coded video sequence in the scalable 
   layer in which the active sequence parameter set or active layer SVC 
   sequence parameter set is referred to.  This means that the referred 
   sequence parameter set or subset sequence parameter set can only 
 
 
Wenger, et al           Expires March 26, 2009                 [Page 8] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   change at IDR access units for any layer.  At any time instant 
   during the decoding process there may be one active picture 
   parameter set (for the layer representation with the highest value 
   of DQId) and one or more active layer picture parameter set(s) (for 
   layer representations with lower values of DQId).  The active 
   picture parameter set or an active layer picture parameter set 
   remains unchanged throughout a layer representation in which the 
   active picture parameter set or active layer picture parameter set 
   is referred to, but may change from one AU to the next. 

1.1.3. NAL Unit Header 

   SVC extends the one-byte H.264/AVC NAL unit header by three 
   additional octets for NAL units of type 14 and 20.  The header 
   indicates the type of the NAL unit, the (potential) presence of bit 
   errors or syntax violations in the NAL unit payload, information 
   regarding the relative importance of the NAL unit for the decoding 
   process, the layer identification information, and other fields as 
   discussed below. 

   The syntax and semantics of the NAL unit header are specified in 
   [H.264], but the essential properties of the NAL unit header are 
   summarized below for convenience. 

   The first byte of the NAL unit header has the following format (the 
   bit fields are the same as defined for the one-byte H.264/AVC NAL 
   unit header, while the semantics of some fields have changed 
   slightly, in a backwards compatible way): 

         +---------------+ 
         |0|1|2|3|4|5|6|7| 
         +-+-+-+-+-+-+-+-+ 
         |F|NRI|  Type   | 
         +---------------+ 
    
   The semantics of the components of the NAL unit type octet, as 
   specified in [H.264], are described briefly below.  In addition to 
   the name and size of each field, the corresponding syntax element 
   name in [H.264] is also provided. 

   F: 1 bit 
      forbidden_zero_bit.  H.264/AVC declares a value of 1 as a syntax 
      violation.   

   NRI: 2 bits 
      nal_ref_idc.  A value of "00" (in binary form) indicates that the 
      content of the NAL unit is not used to reconstruct reference 
 
 
Wenger, et al           Expires March 26, 2009                 [Page 9] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

      pictures for future prediction.  Such NAL units can be discarded 
      without risking the integrity of the reference pictures in the 
      same layer.  A value greater than "00" indicates that the 
      decoding of the NAL unit is required to maintain the integrity of 
      reference pictures in the same layer, or that the NAL unit 
      contains parameter sets.  

   Type: 5 bits 
      nal_unit_type.  This component specifies the NAL unit type as 
      defined in Table 7-1 of [H.264], and later within this memo.  For 
      a reference of all currently defined NAL unit types and their 
      semantics, please refer to Section 7.4.1 in [H.264]. 

      In H.264/AVC, NAL unit types 14, 15 and 20 are reserved for 
      future extensions.  SVC uses these three NAL unit types as 
      follows: NAL unit type 14 is used for prefix NAL unit, NAL unit 
      type 15 is used for subset sequence parameter set, and NAL unit 
      type 20 is used for coded slice in scalable extension (see 
      Section 7.4.1 in [H.264]).  NAL unit types 14 and 20 indicate the 
      presence of three additional octets in the NAL unit header, as 
      shown below. 

            +---------------+---------------+---------------+ 
            |0|1|2|3|4|5|6|7|0|1|2|3|4|5|6|7|0|1|2|3|4|5|6|7| 
            +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
            |R|I|   PRID    |N| DID |  QID  | TID |U|D|O| RR| 
            +---------------+---------------+---------------+ 
    
   R: 1 bit 
      reserved_one_bit.  Reserved bit for future extension.  R must be 
      equal to 1.  The value of R should be ignored. 

   I: 1 bit 
      idr_flag.  This component specifies whether the layer 
      representation is an instantaneous decoding refresh (IDR) layer 
      representation (when equal to 1) or not (when equal to 0). 

   PRID: 6 bits 
      priority_id.  This flag specifies a priority identifier for the 
      NAL unit.  A lower value of PRID indicates a higher priority. 

   N: 1 bit 
      no_inter_layer_pred_flag.  This flag specifies, when present in a 
      coded slice NAL unit, whether inter-layer prediction may be used 
      for decoding the coded slice (when equal to 1) or not (when equal 
      to 0). 

 
 
Wenger, et al           Expires March 26, 2009                [Page 10] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   DID: 3 bits 
      dependency_id.  This component indicates the inter-layer coding 
      dependency level of a layer representation.  At any access unit, 
      a layer representation with a given dependency_id may be used for 
      inter-layer prediction for coding of a layer representation with 
      a higher dependency_id, while a layer representation with a given 
      dependency_id shall not be used for inter-layer prediction for 
      coding of a layer representation with a lower dependency_id. 

   QID: 4 bits 
      quality_id.  This component indicates the quality level of an MGS 
      layer representation.  At any access unit and for identical 
      dependency_id values, a layer representation with quality_id 
      equal to ql uses a layer representation with quality_id equal to 
      ql-1 for inter-layer prediction. 

   TID: 3 bits 
      temporal_id.  This component indicates the temporal level of a 
      layer representation.  The temporal_id is associated with the 
      frame rate, with lower values of _temporal_id corresponding to 
      lower frame rates.  A layer representation at a given temporal_id 
      typically depends on layer representations with lower temporal_id 
      values, but it never depends on layer representations with higher 
      temporal_id values. 

   U: 1 bit 
      use_ref_base_pic_flag.  A value of 1 indicates that only 
      reference base pictures are used during the inter prediction 
      process.  A value of 0 indicates that the reference base pictures 
      are not used during the inter prediction process. 

   D: 1 bit 
      discardable_flag.  A value of 1 indicates that the current NAL 
      unit is not used for decoding NAL units with values of 
      dependency_id higher than the one of the current NAL unit, in the 
      current and all subsequent access units.  Such NAL units can be 
      discarded without risking the integrity of layers with higher 
      dependency_id values.  discardable_flag equal to 0 indicates that 
      the decoding of the NAL unit is required to maintain the 
      integrity of layers with higher dependency_id. 

   O: 1 bit 
      output_flag: Affects the decoded picture output process as 
      defined in Annex C of [H.264]. 

   RR: 2 bits 
      reserved_three_2bits.  Reserved bits for future extension.  RR 
 
 
Wenger, et al           Expires March 26, 2009                [Page 11] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

      MUST be equal to "11" (in binary form).  The value of RR should 
      be ignored. 

   This memo extends the semantics of F, NRI, I, PRID, DID, QID, TID, 
   U, and D per Annex G of [H.264] as described in Section 4.2. 

1.2. Overview of the Payload Format 

   Similar to RFC 3984, this payload format can only be used to carry 
   the raw NAL unit stream over RTP and not the byte stream format 
   specified in Annex B of [H.264].   

   The design principles, transmission modes, packetization modes as 
   well as new payload structures are summarized in this section.  It 
   is assumed that the reader is familiar with the terminology and 
   concepts defined in RFC 3984. 

1.2.1 Design Principles 

   The following design principles have been observed for this payload 
   format: 

   o  Backward compatibility with [RFC3984] wherever possible. 

   o  The SVC base layer or any H.264/AVC compatible subset of the SVC 
      base layer, when transmitted in its own RTP stream, must be  
      encapsulated using [RFC3984].  This ensures that such an RTP 
      stream can be understood by RFC 3984 receivers. 

   o  Media-Aware Network Elements (MANEs) as defined in [RFC3984] are 
      signaling-aware, rely on signaling information, and have state. 

   o  MANEs can aggregate multiple RTP streams, possibly from multiple 
      RTP sessions. 

   o  MANEs can perform media-aware stream thinning (selective 
      elimination of packets or portions thereof).  By using the 
      payload header information identifying layers within an RTP 
      session, MANEs are able to remove packets or portions thereof 
      from the incoming RTP packet stream.  This implies rewriting the 
      RTP headers of the outgoing packet stream and rewriting of RTCP 
      Receiver Reports. 

1.2.2 Transmission Modes and Packetization Modes 

   This memo allows the packetization of SVC data for both single-
   session transmission (SST) and multi-session transmission (MST).  In 
 
 
Wenger, et al           Expires March 26, 2009                [Page 12] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   the case of SST all SVC data are carried in a single RTP session.  
   In the case of MST two or more RTP sessions are used to carry the 
   SVC data, in accordance with the MST-specific packetization modes 
   defined in this memo, which are based on the packetization modes 
   defined in RFC 3984.  In MST, each RTP session is associated with 
   one RTP stream, which may carry one or more layers. 

   The base layer is, by design, compatible to H.264/AVC.  During 
   transmission, the associated prefix NAL units, which are introduced 
   by SVC and, when present, are ignored by H.264/AVC decoders, may be 
   encapsulated within the same RTP packet stream as the H.264/AVC VCL 
   NAL units, or in a different RTP packet stream (when MST is used).  
   For convenience, the term "AVC base layer" is used to refer to the 
   base layer without prefix NAL units, while the term "SVC base layer" 
   is used to refer to the base layer with prefix NAL units.   

   Furthermore, the base layer may have multiple temporal components 
   (i.e., supporting different frame rates).  As a result, the lowest 
   temporal component ("T0") of the AVC or SVC base layer is used as 
   the starting point of the SVC bitstream hierarchy.  

   This memo allows encapsulating in a given RTP stream any of the 
   following three alternatives of layer combinations: 

   1. the T0 AVC base layer or the T0 SVC base layer only; 
   2. one or more enhancement layers only;  
   3. the T0 SVC base layer, and one or more enhancement layers. 

   SST should be used in point-to-point unicast applications and, in 
   general, whenever the potential benefit of using multiple RTP 
   sessions does not justify the added complexity. When SST is used the 
   layer combination cases 1 and 3 above can be used.  When an 
   H.264/AVC compatible subset of the SVC base layer is transmitted 
   using SST, the packetization of RFC 3984 must be used, thus ensuring 
   compatibility with RFC 3984 receivers.  When, however, one or more 
   SVC quality or spatial enhancement layers are transmitted using SST, 
   the packetization defined in this memo must be used.  In SST, any of 
   the three RFC 3984 packetization modes, namely Single NAL Unit Mode, 
   Non-Interleaved Mode, and Interleaved Mode, can be used. 

   MST should be used in a multicast session when different receivers 
   may request different layers of the scalable bitstream.  An 
   operation point for an SVC bit stream, as defined in this memo, 
   corresponds to a set of layers that together conform to one of the 
   profiles defined in Annex A or G of [H.264] and, when decoded, offer 
   a representation of the original video at a certain fidelity.  The 
   number of streams used in MST should be at least equal to the number 
 
 
Wenger, et al           Expires March 26, 2009                [Page 13] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   of operation points that may be requested by the receivers.  
   Depending on the application, this may result in each layer being 
   carried in its own RTP session, or in having multiple layers 
   encapsulated within one RTP session. 

         Informative note: Layered multicast is a term commonly used to 
         describe the application where multicast is used to transmit 
         layered or scalable data that has been encapsulated into more 
         than one RTP session.  This application allows different 
         receivers in the multicast session to receive different 
         operation points of the scalable bitstream.  Layered 
         multicast, among other application examples, is discussed in 
         more detail in Section 11.2. 

   When MST is used, any of the three layer combinations above can be 
   used for each of the sessions.  When an H.264/AVC compatible subset 
   of the SVC base layer is transmitted in its own session in MST, the 
   packetization of RFC 3984 must be used, such that RFC 3984 receivers 
   can be part of the MST and receive only this session.  For MST, this 
   memo defines four different MST specific packetization modes, namely 
   Non-Interleaved Timestamp based Mode (NI-T), Non-Interleaved Cross-
   Layer Decoding Order Number (CS-DON) based Mode (NI-C), Non-
   Interleaved Combined Timestamp and CS-DON Mode (NI-TC), and 
   Interleaved CS-DON based Mode (I-C) (detailed in Section 4.5.2).  
   The modes differ depending on whether the SVC data are allowed to be 
   interleaved, i.e., to be transmitted in an order different than the 
   intended decoding order, and they also differ in the mechanisms 
   provided in order to recover the correct decoding order of the NAL 
   units across the multiple RTP sessions.  These four MST modes re-use 
   the packetization modes introduced in RFC 3984 for the packetization 
   of NAL units in each of their individual RTP sessions. 

   As the names of the MST packetization modes imply, the NI-T, NI-C 
   and NI-TC modes do not allow interleaved transmission, while the I-C 
   mode allows interleaved transmission.  With any of the three non-
   interleaved MST packetization modes, legacy RFC 3984 receivers with 
   implementation of the Non-Interleaved Mode specified in RFC 3984 can 
   join a multi-session transmission of SVC, to receive the base RTP 
   session encapsulated according to RFC 3984. 

1.2.3 New Payload Structures 

   RFC 3984 specifies three basic payload structures, namely Single NAL 
   Unit Packet, Aggregation Packet, and Fragmentation Unit.  Depending 
   on the basic payload structure, an RTP packet may contain a NAL unit 
   not aggregating other NAL units, one or more NAL units aggregated in 
   another NAL unit, or a fragment of a NAL unit not aggregating other 
 
 
Wenger, et al           Expires March 26, 2009                [Page 14] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   NAL units.  Each NAL unit of a type specified in [H.264] (i.e., 1 to 
   23, inclusive) may be carried in its entirety in a single NAL unit 
   packet, may be aggregated in an aggregation packet, or may be 
   fragmented and carried in a number of fragmentation unit packets.  
   To enable aggregation or fragmentation of NAL units while still 
   ensuring that the RTP packet payload is only comprised of NAL units, 
   RFC 3984 introduced six new NAL unit types (24-29) to be used as 
   payload structures, selected from the NAL unit types left 
   unspecified in [H.264]. 

   This memo reuses all the payload structures used in RFC 3984. 
   Furthermore, three new types of NAL units are defined: namely 
   Payload Content Scalability Information (PACSI) NAL unit, Empty NAL 
   unit, and Non-Interleaved Multi-Time Aggregation Packet (NI-MTAP) 
   (specified in Sections 4.9, 4.10, and 4.7.1, respectively). 

   PACSI NAL units may be used for the following purposes: 

   o  To enable MANEs to decide whether to forward, process or discard 
     aggregation packets, by checking in PACSI NAL units the 
     scalability information and other characteristics of the 
     aggregated NAL units, rather than looking into the aggregated NAL 
     units themselves, which are defined by the video coding 
     specification. 
      
   o  To enable correct decoding order recovery in MST using the NI-C 
     or NI-TC mode, with the help of the CS-DON information included in 
     PACSI NAL units. 
 
   o  To improve resilience to packet losses, e.g. by utilizing the 
      following data or information included in PACSI NAL units: 
      repeated Supplemental Enhancement Information (SEI) messages, 
      information regarding the start and end of layer representations, 
      and the indices to layer representations of the lowest temporal 
      subset. 

   Empty NAL units may be used to enable correct decoding order 
   recovery in MST using the NI-T or NI-TC mode.  NI-MTAP NAL units may 
   be used to aggregate NAL units from multiple access units but 
   without interleaving. 

2. Conventions 

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", 
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this 
   document are to be interpreted as described in BCP 14, RFC 2119 
   [RFC2119]. 
 
 
Wenger, et al           Expires March 26, 2009                [Page 15] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   This specification uses the notion of setting and clearing a bit 
   when bit fields are handled.  Setting a bit is the same as assigning 
   that bit the value of 1 (On).  Clearing a bit is the same as 
   assigning that bit the value of 0 (Off). 

3. Definitions and Abbreviations 

3.1 Definitions 

3.1.1 Definitions from the SVC Specification 

   This document uses the terms and definitions of [H.264].  The 
   following terms are relevant to this memo, and their definitions are 
   copied here from [H.264] for convenience. 

      access unit: A set of NAL units always containing exactly one 
      primary coded picture.  In addition to the primary coded picture, 
      an access unit may also contain one or more redundant coded 
      pictures, one auxiliary coded picture, or other NAL units not 
      containing slices or slice data partitions of a coded picture.  
      The decoding of an access unit always results in a decoded 
      picture. 

      base layer: A bitstream subset that contains all the NAL units 
      with the nal_unit_type syntax element equal to 1 or 5 of the 
      bitstream and does not contain any NAL unit with the 
      nal_unit_type syntax element equal to 14, 15, or 20 and conforms 
      to one or more of the profiles specified in Annex A of [H.264]. 

      base quality layer representation: The layer representation of 
      the target dependency representation of an access unit that is 
      associated with the quality_id syntax element equal to 0. 

      coded video sequence: A sequence of access units that consists, 
      in decoding order, of an IDR access unit followed by zero or more 
      non-IDR access units including all subsequent access units up to 
      but not including any subsequent IDR access unit. 

      dependency representation: A subset of Video Coding Layer (VCL) 
      NAL units within an access unit that are associated with the same 
      value of the dependency_id syntax element, which is provided as 
      part of the NAL unit header or by an associated prefix NAL unit.  
      A dependency representation consists of one or more layer 
      representations. 

      IDR access unit: An access unit in which the primary coded 
      picture is an IDR picture. 
 
 
Wenger, et al           Expires March 26, 2009                [Page 16] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

      IDR picture: Instantaneous Decoding Refresh picture.  A coded 
      picture in which all slices of the target dependency 
      representation within the access unit are I or EI slices that 
      causes the decoding process to mark all reference pictures as 
      "unused for reference" immediately after decoding the IDR 
      picture.  After the decoding of an IDR picture all following 
      coded pictures in decoding order can be decoded without inter 
      prediction from any picture decoded prior to the IDR picture.  
      The first picture of each coded video sequence is an IDR picture. 

      layer representation: A subset of VCL NAL units within an access 
      unit that are associated with the same values of the 
      dependency_id and quality_id syntax elements, which are provided 
      as part of the VCL NAL unit header or by an associated prefix NAL 
      unit.  One or more layer representations represent a dependency 
      representation.  

      prefix NAL unit: A NAL unit with nal_unit_type equal to 14 that 
      immediately precedes in decoding order a NAL unit with 
      nal_unit_type equal to 1, 5, or 12.  The NAL unit that 
      immediately succeeds in decoding order the prefix NAL unit is 
      referred to as the associated NAL unit.  The prefix NAL unit 
      contains data associated with the associated NAL unit, which are 
      considered to be part of the associated NAL unit. 

      reference base picture: A reference picture that is obtained by 
      decoding a base quality layer representation with the nal_ref_idc 
      syntax element not equal to 0 and the store_ref_base_pic_flag 
      syntax element equal to 1 of an access unit and all layer 
      representations of the access unit that are referred to by inter-
      layer prediction of the base quality layer representation.  A 
      reference base picture is not an output of the decoding process, 
      but the samples of a reference base picture may be used for inter 
      prediction in the decoding process of subsequent pictures in 
      decoding order.  Reference base picture is a collective term for 
      a reference base field or a reference base frame. 

      scalable bitstream: A bitstream with the property that one or 
      more bitstream subsets that are not identical to the scalable 
      bitstream form another bitstream that conforms to the SVC 
      specification[SVC]. 

      target dependency representation: The dependency representation 
      of an access unit that is associated with the largest value of 
      the dependency_id syntax element for all dependency 
      representations of the access unit. 

 
 
Wenger, et al           Expires March 26, 2009                [Page 17] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

      target layer representation: The layer representation of the 
      target dependency representation of an access unit that is 
      associated with the largest value of the quality_id syntax 
      element for all layer representations of the target dependency 
      representation of the access unit. 

3.1.2 Definitions Specific to This Memo 

      anchor layer representation: An anchor layer representation is 
      such a layer representation that, if decoding of the operation 
      point corresponding to the layer starts from the access unit 
      containing this layer representation, all the following layer 
      representations of the layer, in output order, can be correctly 
      decoded.  The output order is defined in [H.264] as the order in 
      which decoded pictures are output from the decoded picture buffer 
      of the decoder.  As H.264 does not specify the picture display 
      process, this more general term is used instead of display order.  
      An anchor layer representation is a random access point to the 
      layer the anchor layer representation belongs to.  However, some 
      layer representations, succeeding an anchor layer representation 
      in decoding order but preceding the anchor layer representation 
      in output order, may refer to earlier layer representations for 
      inter prediction, and hence the decoding may be incorrect if 
      random access is performed at the anchor layer representation. 

      AVC base layer: The subset of the SVC base layer in which all 
      prefix NAL units (type 14) are removed.  Note that this is 
      equivalent to the term "base layer" as defined in Annex G of 
      [H.264]. 

      base RTP session: When multi-session transmission is used, the 
      RTP session that carries the RTP stream containing the T0 AVC 
      base layer or the T0 SVC base layer, and zero or more enhancement 
      layers.  This RTP session does not depend on any other RTP 
      session as indicated by mechanisms defined in [I-D.ietf-mmusic-
      decoding-dependency].  The base RTP session may carry NAL units 
      of NAL unit type equal to 14 and 15. 

      Empty NAL unit: A NAL unit with NAL unit type equal to 31 and 
      sub-type equal to 1.  An Empty NAL unit consists of only the two-
      byte NAL unit header with an empty payload.    

      enhancement RTP session: When multi-session transmission is used, 
      an RTP session that is not the base RTP session.  An enhancement 
      RTP session typically contains an RTP stream that depends on at 
      least one other RTP session as indicated by mechanisms defined in 
      [I-D.ietf-mmusic-decoding-dependency].  A lower RTP session to an 
 
 
Wenger, et al           Expires March 26, 2009                [Page 18] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

      enhancement RTP session is an RTP session which the enhancement 
      RTP session depends on.  The lowest RTP session for a receiver is 
      the RTP session that does not depend on any other RTP session 
      received by the receiver.  The highest RTP session for a receiver 
      is the RTP session which no other RTP session received by the 
      receiver depends on. 

      cross-session decoding order number (CS-DON): A derived variable 
      indicating NAL unit decoding order number over all NAL units 
      within all the session-multiplexed RTP sessions that carry the 
      same SVC bitstream. 

      enhancement layer: A layer in which at least one of the values of 
      dependency_id or quality_id is higher than 0, or a layer in which 
      none of the NAL units is associated with the value of temporal_id 
      equal to 0.  An operation point constructed using the maximum 
      temporal_id, dependency_id, and quality_id values associated with 
      an enhancement layer may or may not conform to one or more of the 
      profiles specified in Annex A of [H.264]. 

      H.264/AVC compatible: The property of a bitstream subset of 
      conforming to one or more of the profiles specified in Annex A of 
      [H.264]. 

      intra layer representation:  A layer representation that contains 
      only slices that use intra prediction, and hence do not refer to 
      any earlier layer representation in decoding order in the same 
      layer.  Note that in SVC intra prediction includes intra-layer 
      intra prediction as well as inter-layer intra prediction. 

      layer: A bitstream subset in which all NAL units of type 1, 5, 
      12, 14, or 20 have the same values of dependency_id and 
      quality_id, either directly through their NAL unit header (for 
      NAL units of type 14 or 20) or through association to a prefix 
      (type 14) NAL unit (for NAL unit types 1, 5, or 12).  A layer may 
      contain NAL units associated with more than one values of 
      temporal_id. 

      multi-session transmission: The transmission mode in which the 
      SVC bitstream is transmitted over multiple RTP sessions, with 
      each stream having the same SSRC.  These multiple RTP streams can 
      be associated using the RTCP CNAME, or explicit signalling of the 
      SSRC used.  Dependency between RTP sessions MUST be signaled 
      according to [I-D.ietf-mmusic-decoding-dependency] and this memo.  

      operation point: An operation point is identified by a set of 
      values of temporal_id, dependency_id, and quality_id.  A 
 
 
Wenger, et al           Expires March 26, 2009                [Page 19] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

      bitstream corresponding to an operation point can be constructed 
      by removing all NAL units associated with a higher value of 
      dependency_id, and all NAL units associated with the same value 
      of dependency_id but higher values of quality_id or temporal_id.  
      An operation point bitstream conforms to at least one of the 
      profiles defined in Annex A or Annex G of [H.264], and offers a 
      representation of the original video signal at a certain 
      fidelity.  

          Informative Note: Additional NAL units may be removed (with 
          lower dependency_id or same dependency_id but lower 
          quality_id) if they are not required for decoding the 
          bitstream at the particular operation point.  The resulting 
          bitstream, however, may no longer conform to any of the 
          profiles defined in Annex A or G of [H.264]. 

      operation point representation: The set of all NAL units of an 
      operation point within the same access unit. 

      RTP packet stream: A sequence of RTP packets with increasing 
      sequence numbers (except for wrap-around), identical PT and 
      identical SSRC (Synchronization Source), carried in one RTP 
      session.  Within the scope of this memo, one RTP packet stream is 
      utilized to transport one or more layers. 

      single-session transmission: The transmission mode in which the 
      SVC bitstream is transmitted over a single RTP session, with a 
      single SSRC and separate timestamp and sequence number spaces. 

      SVC base layer: The layer that includes all NAL units associated 
      with dependency_id and quality_id values both equal to 0, 
      including prefix NAL units (NAL unit type 14). 

      SVC enhancement layer: A layer in which at least one of the 
      values of dependency_id or quality_id is higher than 0.  An 
      operation point constructed using the maximum dependency_id and 
      quality_id values and any temporal_id value associated with an 
      SVC enhancement layer does not conform to any of the profiles 
      specified in Annex A of [H.264]. 

      SVC NAL unit: A NAL unit of NAL unit type 14, 15, or 20 as 
      specified in Annex G of [H.264]. 

      SVC NAL unit header: A four-byte header resulting from the 
      addition of a three-byte SVC-specific header extension added in 
      NAL unit types 14 and 20. 

 
 
Wenger, et al           Expires March 26, 2009                [Page 20] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

      SVC RTP session: Either the base RTP session or an enhancement 
      RTP session.   

      T0 AVC base layer: A subset of the AVC base layer constructed by 
      removing all VCL NAL units associated with temporal_id values 
      higher than 0 and non-VCL NAL units and SEI messages associated 
      only with the VCL NAL units being removed. 

      T0 SVC base layer: A subset of the SVC base layer constructed by 
      removing all VCL NAL units associated with temporal_id values 
      higher than 0 as well as prefix NAL units, non-VCL NAL units, and 
      SEI messages associated only with the VCL NAL units being 
      removed. 

3.2 Abbreviations 

   In addition to the abbreviations defined in [RFC3984], the following 
   abbreviations are used in this memo. 

      CGS:        Coarse-Grain Scalability 
      CS-DON:     Cross-Session Decoding Order Number 
      MGS:        Medium-Grain Scalability 
      MST:       Multi-Session Transmission 
      PACSI:      Payload Content Scalability Information 
      SST:       Single-Session Transmission 
      SNR:       Signal-to-Noise Ratio 
      SVC:        Scalable Video Coding 

4. RTP Payload Format 

4.1 RTP Header Usage 

   In addition to section 5.1 of [RFC3984] the following rules apply. 

   o Setting of the M bit  

   The M bit of an RTP packet for which the packet payload is an NI-
   MTAP MUST be equal to 1 if the last NAL unit, in decoding order, of 
   the access unit associated with the RTP timestamp is contained in 
   the packet. 

   o Setting of the RTP timestamp: 

   For an RTP packet for which the packet payload is an Empty NAL unit, 
   the RTP timestamp must be set according to Section 4.10.  


 
 
Wenger, et al           Expires March 26, 2009                [Page 21] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   For an RTP packet for which the packet payload is a PACSI NAL unit, 
   the RTP timestamp MUST be equal to the NALU-time of the next non-
   PACSI NAL unit in transmission order. Recall that the NALU-time of a 
   NAL unit in an MTAP is defined in RFC 3984 as the value that the RTP 
   timestamp would have if that NAL unit would be transported in its 
   own RTP packet. 

   o Setting of the SSRC: 

   For both SST and MST, the SSRC values MUST be set according to [RFC 
   3550].   

4.2 NAL Unit Extension and Header Usage 

4.2.1 NAL Unit Extension 

   This memo specifies a NAL unit extension mechanism to allow for 
   introduction of new types of NAL units, beyond the three NAL unit 
   types left undefined in RFC 3984 (i.e., 0, 30 and 31).  The 
   extension mechanism utilizes the NAL unit type value 31 and is 
   specified as follows.  When the NAL unit type value is equal to 31, 
   the one-byte NAL unit header consisting of the F, NRI and Type 
   fields as specified in Section 1.1.3 is extended by one additional 
   octet, which consists of a 5-bit field named Subtype and three 1-bit 
   fields named J, K, and L, respectively.  The additional octet is 
   shown in the following figure. 

         +---------------+ 
         |0|1|2|3|4|5|6|7| 
         +-+-+-+-+-+-+-+-+ 
         | Subtype |J|K|L| 
         +---------------+ 
    
   The Subtype value determines the (extended) NAL unit type of this 
   NAL unit.  The interpretation of the fields J, K, and L depends on 
   the Subtype.  The semantics of the fields are as follows. 

   When Subtype is equal to 1, the NAL unit is an Empty NAL unit as 
   specified in Section 4.10.  When Subtype is equal to 2, the NAL unit 
   is an NI-MTAP NAL unit as specified in Section 4.7.1. All other 
   values of Subtype (0, 3-31) are reserved for future extensions, and 
   receivers SHOULD ignore the entire NAL unit when Subtype is equal to 
   any of these reserved values. 




 
 
Wenger, et al           Expires March 26, 2009                [Page 22] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

4.2.2 NAL Unit Header Usage 

   The structure and semantics of the NAL unit header according to the 
   H.264 specification [H.264] were introduced in Section 1.1.3.  This 
   section specifies the extended semantics of the NAL unit header 
   fields F, NRI, I, PRID, DID, QID, TID, U, and D, according to this 
   memo.  When the Type field is equal to 31, the semantics of the 
   fields in the extension NAL unit header were specified in Section 
   4.2.1. 

   The semantics of F specified in Section 5.3 of [RFC3984] also apply 
   in this memo. That is, a value of 0 for F indicates that the NAL 
   unit type octet and payload should not contain bit errors or other 
   syntax violations, whereas a value of 1 for F indicates that the NAL 
   unit type octet and payload may contain bit errors or other syntax 
   violations. MANEs SHOULD set the F bit to indicate bit errors in the 
   NAL unit. 

   For NRI, for a bitstream conforming to one of the profiles defined 
   in Annex A of [H.264] and transported using [RFC3984], the semantics 
   specified in Section 5.3 of [RFC3984] apply, i.e., NRI also 
   indicates the relative importance of NAL units.  For a bitstream 
   conforming to one of the profiles defined in Annex G of [H.264] and 
   transported using this memo, in addition to the semantics specified 
   in Annex G of [H.264], NRI also indicates the relative importance of 
   NAL units within a layer. 

   For I, in addition to the semantics specified in Annex G of [H.264], 
   according to this memo, MANEs MAY use this information to protect 
   NAL units with I equal to 1 better than NAL units with I equal to 0.  
   MANEs MAY also utilize information of NAL units with I equal to 1 to 
   decide when to forward more packets for an RTP packet stream.  For 
   example, when it is detected that spatial layer switching has 
   happened such that the operation point has changed to a higher value 
   of DID, MANEs MAY start to forward NAL units with the higher value 
   of DID only after forwarding a NAL unit with I equal to 1 with the 
   higher value of DID. 

   Note that, in the context of this section, "protecting a NAL unit" 
   means any RTP or network transport mechanism that could improve the 
   probability of successful delivery of the packet conveying the NAL 
   unit, including applying a QoS-enabled network, Forward Error 
   Correction (FEC), retransmissions, and advanced scheduling behavior, 
   whenever possible. 

   For PRID, the semantics specified in Annex G of [H.264] apply.  Note 
   that MANEs implementing unequal error protection MAY use this 
 
 
Wenger, et al           Expires March 26, 2009                [Page 23] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   information to protect NAL units with smaller PRID values better 
   than those with larger PRID values, for example by including only 
   the more important NAL units in an FEC protection mechanism.  The 
   importance for the decoding process decreases as the PRID value 
   increases. 

   For DID, QID, TID, in addition to the semantics specified in Annex G 
   of [H.264], according to this memo, values of DID, QID, or TID 
   indicate the relative importance in their respective dimension.  A 
   lower value of DID, QID, or TID indicates a higher importance if the 
   other two components are identical.  MANEs MAY use this information 
   to protect more important NAL units better than less important NAL 
   units. 

   For U, in addition to the semantics specified in Annex G of [H.264], 
   according to this memo, MANEs MAY use this information to protect 
   NAL units with U equal to 1 better than NAL units with U equal to 0. 

   For D, in addition to the semantics specified in Annex G of [H.264], 
   according to this memo, MANEs MAY use this information to determine 
   whether a given NAL unit is required for successfully decoding a 
   certain Operation Point of the SVC bitstream, hence to decide 
   whether to forward the NAL unit. 

4.3 Payload Structures 

   The NAL unit structure is central to H.264/AVC, RFC 3984, as well as 
   SVC and this memo.  In H.264/AVC and SVC, all coded bits for 
   representing a video signal are encapsulated in NAL units.  In RFC 
   3984, each RTP packet payload is structured as a NAL unit, which 
   contains one or a part of one NAL unit specified in H.264/AVC, or 
   aggregates one or more NAL units specified in H.264/AVC. 

   RFC 3984 specifies three basic payload structures (in Section 5.2 of 
   [RFC3984]): Single NAL Unit Packet, Aggregation Packet, and Fragment 
   Unit, and six new types (24 to 29) of NAL units.  The value of the 
   Type field of the RTP packet payload header (i.e., the first byte of 
   the payload) may be equal to any value from 1 to 23  for a Single 
   NAL Unit Packet, any value from 24 to 27 for an Aggregation Packet, 
   and 28 or 29 for a Fragmentation Unit.  

   In addition to the NAL unit types defined originally for H.264/AVC, 
   SVC defines three new NAL unit types specifically for SVC: coded 
   slice in scalable extension NAL units (type 20), prefix NAL units 
   (type 14), and subset sequence parameter set NAL units (type 15), as 
   described in Section 1.1.   

 
 
Wenger, et al           Expires March 26, 2009                [Page 24] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   This memo further introduces three new types of NAL units, PACSI NAL 
   unit (NAL unit type 30) as specified in Section 4.9, Empty NAL unit 
   (type 31, subtype 1) as specified in Section 4.10, and NI-MTAP NAL 
   unit (type 31, subtype 2) as specified in Section 4.7.1. 

   The RTP packet payload structure in RFC 3984 is maintained with 
   slight extensions in this memo, as follows.  Each RTP packet payload 
   is still structured as a NAL unit, which contains one or a part of 
   one NAL unit specified in H.264/AVC and SVC, or contains one PACSI 
   NAL unit or one Empty NAL unit, or aggregates zero or more NAL units 
   specified in H.264/AVC and SVC, zero or one PACSI NAL unit, and zero 
   or more Empty NAL units.  

   In this memo, one of the three basic payload structures, 
   Fragmentation Unit, remains the same as in RFC 3984, and the other 
   two, Single NAL Unit Packet and Aggregation Packet, are extended as 
   follows.  The value of the Type field of the payload header may be 
   equal to any value from 1 to 23, inclusive, and 30 to 31, inclusive, 
   for a Single NAL Unit Packet, and any value from 24 to 27, 
   inclusive, and 31, for an Aggregation Packet.  When the Type field 
   of the payload header is equal to 31 and the Subtype field of the 
   payload header is equal to 2, the packet is an Aggregation Packet 
   (containing a NI-MTAP NAL unit).  When the Type field of the payload 
   header is equal to 31 and the Subtype field of the payload header is 
   equal to 1, the packet is a Single NAL Unit Packet (containing an 
   Empty NAL unit). 

   Note that, in this memo, the length of the payload header varies 
   depending on the value of the Type field in the first byte of the 
   RTP packet payload.  If the value is equal to 14, 20, or 30, the 
   first four bytes of the packet payload form the payload header; 
   otherwise if the value is equal to 31, the first two bytes of the 
   payload form the payload header; otherwise, the payload header is 
   the first byte of the packet payload.  

   Table 1 lists the NAL unit types introduced in SVC and this memo and 
   where they are described in this memo.  Table 2 summarizes the basic 
   payload structure types for all NAL unit types when they are 
   directly used as RTP packet payloads according to this memo.   

                                    

                                    

                                    

                                    
 
 
Wenger, et al           Expires March 26, 2009                [Page 25] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

       Table 1.  NAL unit types introduced in SVC and this memo  

      Type  Subtype  NAL Unit Name                Section Numbers 
      ----------------------------------------------------------- 
      14     -       Prefix NAL unit                    1.1 
      15     -       Subset sequence parameter set      1.1 
      20     -       Coded slice in scalable extension  1.1 
      30     -       PACSI NAL unit                     4.9 
      31     0       reserved                           4.2.1 
      31     1       Empty NAL unit                     4.10 
      31     2       NI-MTAP                            4.7.1 
      31     3-31    reserved                           4.2.1 
    

       Table 2.  Basic payload structure types for all NAL unit 
       types when they are directly used as RTP packet payloads  

      Type   Subtype    Basic Payload Structure 
      ------------------------------------------ 
      0      -          reserved 
      1-23   -          Single NAL Unit Packet 
      24-27  -          Aggregation Packet 
      28-29  -          Fragmentation Unit 
      30     -          Single NAL Unit Packet 
      31     0          reserved 
      31     1          Single NAL Unit Packet 
      31     2          Aggregation Packet 
      31     3-31       reserved 
    
   Table 3 summarizes the NAL unit types allowed to be aggregated 
   (i.e., used as aggregation units in aggregation packets) or 
   fragmented (i.e., carried in fragmentation units) according to this 
   memo. 
    
                                    

                                    

                                    

                                    

                                    

                                    


 
 
Wenger, et al           Expires March 26, 2009                [Page 26] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

         Table 3.  Summary of the NAL unit types allowed to be 
       aggregated or fragmented (yes = allowed, no = disallowed, 
                   - = not applicable/not specified) 

      Type  Subtype STAP-A STAP-B MTAP16 MTAP24 FU-A FU-B NI-MTAP 
      ------------------------------------------------------------- 
      0     -          -      -      -      -     -     -     -  
      1-23  -        yes    yes    yes    yes   yes   yes   yes 
      24-29 -         no     no     no     no    no    no    no 
      30    -        yes    yes    yes    yes    no    no   yes 
      31    0          -      -      -      -     -     -     -  
      31    1        yes     no     no     no    no    no   yes 
      31    2         no     no     no     no    no    no    no 
      31    3-31       -      -      -      -     -     -     -  
                      
4.4 Transmission Modes 

   This memo enables transmission of an SVC bitstream over one or more 
   RTP sessions. If only one RTP session is used for transmission of 
   the SVC bitstream, the transmission mode is referred to as Single-
   Session Transmission (SST); otherwise (more than one RTP session is 
   used for transmission of the SVC bitstream), the transmission mode 
   is referred to as Multi-Session Transmission (MST). 

   SST SHOULD be used for point-to-point unicast scenarios, while MST 
   SHOULD be used for point-to-multipoint multicast scenarios where 
   different receivers requires different operation points of the same 
   SVC bitstream, to improve bandwidth utilizing efficiency. 

   If the OPTIONAL mst-mode media type parameter (see Section 7.1) is 
   not present, SST MUST be used; otherwise (mst-mode is present), MST 
   MUST be used. 

4.5 Packetization Modes 

4.5.1 Packetization Modes for Single-Session Transmission 

   When SST is in use, Section 5.4 of RFC 3984 applies with the 
   following modifications. 

   The packetization modes specified in Section 5.4 of RFC 3984, namely 
   Single NAL Unit Mode, Non-Interleaved Mode and Interleaved Mode, are 
   also referred to as session packetization modes.  Table 4 summarizes 
   the allowed session packetization modes for SST.  



 
 
Wenger, et al           Expires March 26, 2009                [Page 27] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

       Table 4.  Summary of allowed session packetization modes 
       (denoted as "Session Mode" for simplicity) for SST (yes = 
                       allowed, no = disallowed) 

                 Session Mode               Allowed 
                 ------------------------------------- 
                 Single NAL Unit Mode         yes  
                 Non-Interleaved Mode         yes  
                 Interleaved Mode             yes 
    

   For NAL unit types in the range of 0 to 29, inclusive, the NAL unit 
   types allowed to be directly used as packet payloads for each 
   session packetization mode are the same as specified in Section 5.4 
   of RFC 3984.  For other NAL unit types, which are newly introduced 
   in this memo, the NAL unit types allowed to be directly used as 
   packet payloads for each session packetization mode are summarized 
   in Table 5. 

       Table 5.  New NAL unit types allowed to be directly used 
        as packet payloads for each session packetization mode 
        (yes = allowed, no = disallowed, - = not applicable/not 
                              specified) 

      Type   Subtype    Single NAL    Non-Interleaved    Interleaved 
                        Unit Mode           Mode             Mode 
      ------------------------------------------------------------- 
      30     -            yes               no               no 
      31     0              -                -                - 
      31     1             yes             yes               no 
      31     2             no              yes               no 
      31     3-31           -                -                - 
 
4.5.2 Packetization Modes for Multi-Session Transmission 

   For MST, this memo specifies four MST packetization modes: 

   o  Non-interleaved timestamp based mode (NI-T); 
   o  Non-interleaved cross-session decoding order number (CS-DON) 
     based mode (NI-C); 
   o  Non-interleaved combined timestamp and CS-DON mode (NI-TC); and 
   o  Interleaved CS-DON (I-C) mode. 

   These four modes differ in two ways.  First, they differ in terms of 
   whether NAL units are required to be transmitted within each RTP 
   session in decoding order (i.e., non-interleaved), or they are 
   allowed to be transmitted in a different order (i.e., interleaved).  
 
 
Wenger, et al           Expires March 26, 2009                [Page 28] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   Second, they differ in the mechanisms they provide in order to 
   recover the correct decoding order of the NAL units across all RTP 
   sessions involved.  

   The NI-T, NI-C, and NI-TC modes do not allow interleaving, and are 
   thus targeted for systems that require relatively low end-to-end 
   latency, e.g., conversational systems.  The I-C mode allows 
   interleaving and is thus targeted for systems that do not require 
   very low end-to-end latency.  The benefits of interleaving are the 
   same as that of the Interleaved Mode specified in RFC 3984.  

   The NI-T mode uses timestamps to recover the decoding order of NAL 
   units, whereas the NI-C and I-C modes both use the CS-DON mechanism 
   (explained later on) to do so. The NI-TC mode provides both 
   timestamps and the CS-DON method; receivers in this case may choose 
   to use either method for performing decoding order recovery 

   The MST packetization mode in use MUST be signaled by the value of 
   the OPTIONAL mst-mode media type parameter.  The used MST 
   packetization mode governs which session packetization modes are 
   allowed in the associated RTP sessions, which in turn govern which 
   NAL unit types are allowed to be directly used as RTP packet 
   payloads. 

   Table 6 summarizes the allowed session packetization modes for NI-T, 
   NI-C and NI-TC.  Table 7 summarizes the allowed session 
   packetization modes for I-C. 

       Table 6.  Summary of allowed session packetization modes 
       (denoted as "Session Mode" for simplicity) for NI-T, NI-C 
              and NI-TC (yes = allowed, no = disallowed) 

      Session Mode            Base Session    Enhancement Session 
      ----------------------------------------------------------- 
      Single NAL Unit Mode         yes             no 
      Non-Interleaved Mode         yes            yes 
      Interleaved Mode              no             no 
    
                                    

                                    

                                    

                                    


 
 
Wenger, et al           Expires March 26, 2009                [Page 29] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

       Table 7.  Summary of allowed session packetization modes 
       (denoted as "Session Mode" for simplicity) for I-C (yes = 
                       allowed, no = disallowed) 

      Session Mode            Base Session    Enhancement Session 
      ----------------------------------------------------------- 
      Single NAL Unit Mode          no             no 
      Non-Interleaved Mode          no             no 
      Interleaved Mode             yes            yes 
    
   For NAL unit types in the range of 0 to 29, inclusive, the NAL unit 
   types allowed to be directly used as packet payloads for each 
   session packetization mode are the same as specified in Section 5.4 
   of RFC 3984.  For other NAL unit types, which are newly introduced 
   in this memo, the NAL unit types allowed to be directly used as 
   packet payloads for each allowed session packetization mode for NI-
   T, NI-C, NI-TC, and I-C are summarized in Tables 8, 9, 10, and 11, 
   respectively.  

       Table 8.  New NAL unit types allowed to be directly used 
       as packet payloads for each allowed session packetization 
       mode when NI-T is in use (yes = allowed, no = disallowed, 
                   - = not applicable/not specified) 

      Type   Subtype    Single NAL    Non-Interleaved 
                        Unit Mode           Mode      
      --------------------------------------------------- 
      30     -            yes               no       
      31     0              -                -       
      31     1            yes              yes       
      31     2             no              yes       
      31     3-31           -                -       
    
                                    

                                    

                                    

                                    

                                    

                                    

                                    

 
 
Wenger, et al           Expires March 26, 2009                [Page 30] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

       Table 9.  New NAL unit types allowed to be directly used 
       as packet payloads for each allowed session packetization 
       mode when NI-C is in use (yes = allowed, no = disallowed, 
                   - = not applicable/not specified) 

      Type   Subtype    Single NAL    Non-Interleaved 
                        Unit Mode           Mode      
      --------------------------------------------------- 
      30     -            yes              yes       
      31     0              -                -       
      31     1             no               no       
      31     2             no              yes       
      31     3-31           -                -       
    
       Table 10.  New NAL unit types allowed to be directly used 
       as packet payloads for each allowed session packetization 
      mode when NI-TC is in use (yes = allowed, no = disallowed, 
                   - = not applicable/not specified) 

      Type   Subtype    Single NAL    Non-Interleaved 
                        Unit Mode           Mode      
      --------------------------------------------------- 
      30     -            yes              yes       
      31     0              -                -       
      31     1             yes             yes       
      31     2             no              yes       
      31     3-31           -                -       
    
    
       Table 11.  New NAL unit types allowed to be directly used 
       as packet payloads for the allowed session packetization 
      mode when I-C is in use (yes = allowed, no = disallowed, - 
                    = not applicable/not specified) 

      Type   Subtype    Interleaved Mode 
      ------------------------------------ 
      30     -               no            
      31     0                -            
      31     1               no            
      31     2               no            
      31     3-31             -            
    
   When MST is in use and the MST packetization mode in use is NI-C, 
   Empty NAL units (type 31, subtype 1) MUST NOT be used, i.e., no RTP 
   packet is allowed to contain one or more Empty NAL units. 


 
 
Wenger, et al           Expires March 26, 2009                [Page 31] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   When MST is in use and the MST packetization mode in use is I-C, 
   both Empty NAL units (type 31, subtype 1) and NI-MTAP NAL units 
   (type 31, subtype 2) MUST NOT be used, i.e., no RTP packet is 
   allowed to contain one or more Empty NAL units or an NI-MTAP NAL 
   unit. 

4.6 Single NAL Unit Packets 

   Section 5.6 of [RFC3984] applies with the following modifications. 

   The payload of a Single NAL Unit Packet MAY be a PACSI NAL unit 
   (Type 30) or an Empty NAL unit (Type 31 and Subtype 1), in addition 
   to a NAL unit with NAL unit type equal to any value from 1 to 23, 
   inclusive. 

   If the Type field of the first byte of the payload is not equal to 
   31, the payload header is the first byte of the payload. Otherwise 
   (the Type field of the first byte of the payload is equal to 31), 
   the payload header is the first two bytes of the payload. 

4.7 Aggregation Packets 

   In addition to Section 5.7 of [RFC3984], the following applies in 
   this memo. 

4.7.1 Non-Interleaved Multi-Time Aggregation Packets (NI-MTAPs) 

   One new NAL unit type introduced in this memo is the Non-Interleaved 
   Multi-Time Aggregation packet (NI-MTAP).  An NI-MTAP consists of one 
   or more non-interleaved multi-time aggregation units. 

   The NAL units contained in NI-MTAPs MUST be aggregated in decoding 
   order.  NI-MTAPs used in MST MUST always guarantee packets in the 
   corresponding RTP sessions with the same RTP timestamp as the NI-
   MTAP. 

   A non-interleaved multi-time aggregation unit for the NI-MTAP 
   consists of 16 bits of unsigned size information of the following 
   NAL unit (in network byte order), and 16 bits (in network byte 
   order) of timestamp offset (TS offset) for the NAL unit.  The 
   structure is presented in Figure 1.  The starting or ending position 
   of an aggregation unit within a packet may or may not be on a 32-bit 
   word boundary.  The NAL units in the NI-MTAP are ordered in NAL unit 
   decoding order.   

   The Type field of the NI-MTAP MUST be set equal to "31".   

 
 
Wenger, et al           Expires March 26, 2009                [Page 32] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   The F bit MUST be set to 0 if all the F bits of the aggregated NAL 
   units are zero; otherwise, it MUST be set to 1.   

   The value of NRI MUST be the maximum value of NRI across all NAL 
   units carried in the NI-MTAP packet.   

   The field Subtype MUST be equal to 2.   

   If the field J is equal to 1 the optional DON field MUST be present 
   for each of the non-interleaved multi-time aggregation units.  For 
   SST the J field MUST be equal to 0. For MST, in the NI-T mode the J 
   field MUST be equal to 0, whereas in the NI-C or NI-TC mode the J 
   field MUST be equal to 1.  When the NI-C or NI-TC is in use, the DON 
   field, when present, MUST represent the CS-DON value for the 
   particular NAL unit as defined in Section 6.2.2.   

   The fields K and L MUST be both equal to 0.   

   A PACSI NAL unit contained in an NI-MTAP MUST NOT have the DONC 
   field.  

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   :        NAL unit size          |        TS offset              | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |        DON (optional)         |                               | 
   |-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+    NAL unit                   | 
   |                                                               | 
   |                               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                               : 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

            Figure 1  Non-interleaved multi-time aggregation unit for 
                                     NI-MTAP 

   Let TS be the RTP timestamp of the packet carrying the NAL unit.  
   Recall that the NALU-time of a NAL unit in an MTAP is defined in RFC 
   3984 as the value that the RTP timestamp would have if that NAL unit 
   would be transported in its own RTP packet.  The timestamp offset 
   field MUST be set to a value equal to the value of the following 
   formula:  

                 if NALU-time >= TS, TS offset = NALU-time - TS 
                 else, TS offset = NALU-time + (2^32 - TS) 


 
 
Wenger, et al           Expires March 26, 2009                [Page 33] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   For the "earliest" multi-time aggregation unit in an NI-MTAP the 
   timestamp offset MUST be zero.  Hence, the RTP timestamp of the NI-
   MTAP itself is identical to the earliest NALU-time. 

      Informative note: The "earliest" multi-time aggregation unit is 
      the one that would have the smallest extended RTP timestamp among 
      all the aggregation units of an NI-MTAP if the aggregation units 
      were encapsulated in single NAL unit packets.  An extended 
      timestamp is a timestamp that has more than 32 bits and is 
      capable of counting the wraparound of the timestamp field, thus 
      enabling one to determine the smallest value if the timestamp 
      wraps.  Such an "earliest" aggregation unit may or may not be the 
      first one in the order in which the aggregation units are 
      encapsulated in an NI-MTAP.  The "earliest" NAL unit need not be 
      the same as the first NAL unit in the NAL unit decoding order 
      either.  

   Figure 3 presents an example of an RTP packet that contains an NI-
   MTAP that contains two non-interleaved multi-time aggregation units, 
   labeled as 1 and 2 in the figure. 

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                          RTP Header                           | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |F|NRI|  Type   | Subtype |J|K|L|                               | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               | 
   |                                                               | 
   |        Non-interleaved  Multi-time aggregation unit #1        | 
   :                                                               : 
   |                                 +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                                 |  Non-interleaved Multi-time | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                             | 
   |                      aggregation unit #2                      | 
   :                                                               : 
   |                               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                               :...OPTIONAL RTP padding        | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

           Figure 2  An RTP packet including an NI-MTAP containing two 
                   non-interleaved multi-time aggregation units 

4.8 Fragmentation Units (FUs) 

   Section 5.8 of [RFC3984] applies. 

 
 
Wenger, et al           Expires March 26, 2009                [Page 34] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

      Informative note: In case a NAL unit with the four-byte SVC NAL 
      unit header is fragmented, the three-byte SVC-specific header 
      extension is considered as part of the NAL unit payload.  That 
      is, the three-byte SVC-specific header extension is only 
      available in the first fragment of the fragmented NAL unit.  

4.9 Payload Content Scalability Information (PACSI) NAL Unit 

   Another new type of NAL unit specified in this memo is the Payload 
   Content Scalability Information (PACSI) NAL unit.  The Type field of 
   PACSI NAL units MUST be equal to 30 (a NAL unit type value left 
   unspecified in [H.264] and [RFC3984]).  A PACSI NAL unit MAY be 
   carried in a single NAL unit packet or an aggregation packet, and 
   MUST NOT be fragmented.   

   PACSI NAL units may be used for the following purposes: 

   o  To enable MANEs to decide whether to forward, process or discard 
     aggregation packets, by checking in PACSI NAL units the 
     scalability information and other characteristics of the 
     aggregated NAL units, rather than looking into the aggregated NAL 
     units themselves, which are defined by the video coding 
     specification; 
   o  To enable correct decoding order recovery in MST using the NI-C 
     or NI-TC mode, with the help of the CS-DON information included in 
     PACSI NAL units; and 
   o  To improve resilience to packet losses, e.g. by utilizing the 
      following data or information included in PACSI NAL units: 
      repeated Supplemental Enhancement Information (SEI) messages, 
      information regarding the start and end of layer representations, 
      and the indices to layer representations of the lowest temporal 
      subset. 

   PACSI NAL units MAY be ignored in the NI-T mode without affecting 
   the decoding order recovery process. 

   When a PACSI NAL unit is present in an aggregation packet, the 
   following applies. 

   o  The PACSI NAL unit MUST be the first aggregated NAL unit in the 
      aggregation packet. 

   o  There MUST be at least one additional aggregated NAL unit in the 
      aggregation packet. 



 
 
Wenger, et al           Expires March 26, 2009                [Page 35] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   o  The RTP header fields and the payload header fields of the 
      aggregation packet are set as if the PACSI NAL unit was not 
      included in the aggregation packet.  

   o  If the aggregation packet is an MTAP16, MTAP24, or NI-MTAP with 
      the J field equal to 1, the decoding order number (DON) for the 
      PACSI NAL unit MUST be set to indicate that the PACSI NAL unit 
      has an identical DON to the first NAL unit in decoding order 
      among the remaining NAL units in the aggregation packet. 

   When a PACSI NAL unit is included in a single NAL unit packet, it is 
   associated with the next non-PACSI NAL unit in transmission order, 
   and the RTP header fields of the packet are set as if the next non-
   PACSI NAL unit in transmission order was included in a single NAL 
   unit packet. 

   The PACSI NAL unit structure is as follows.  The first four octets 
   are exactly the same as the four-byte SVC NAL unit header discussed 
   in Section 1.1.3.  They are followed by one octet containing several 
   flags, then five optional octets, and finally zero or more SEI NAL 
   units.  Each SEI NAL unit is preceded by a 16-bit unsigned size 
   field (in network byte order) that indicates the size of the 
   following NAL unit in bytes (excluding these two octets, but 
   including the NAL unit header octet of the SEI NAL unit).  Figure 3 
   illustrates the PACSI NAL unit structure and an example of a PACSI 
   NAL unit containing two SEI NAL units. 





















 
 
Wenger, et al           Expires March 26, 2009                [Page 36] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

       0                   1                   2                   3    
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1  
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |F|NRI|  Type   |R|I|   PRID    |N| DID |  QID  | TID |U|D|O| RR| 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |X|Y|T|A|P|C|S|E| TL0PICIDX (o) |        IDRPICID (o)           | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |          DONC (o)             |        NAL unit size 1        | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |                                                               | 
      |                 SEI NAL unit 1                                | 
      |                                                               | 
      |                         +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |                         |        NAL unit size 2        |     | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+     | 
      |                                                               | 
      |            SEI NAL unit 2                                     | 
      |                                           +-+-+-+-+-+-+-+-+-+-+ 
      |                                           | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
             Figure 3  PACSI NAL unit structure.  Fields suffixed by 
                               "(o)"  are OPTIONAL. 

   The bits A, P, C, S, and E are specified only if the bit X is equal 
   to 1.  The fields TL0PICIDX and IDRPICID are present only if the bit 
   Y is equal to 1.  The field DONC is present only if the bit T is 
   equal to 1.  The field T MUST be equal to 0 if the PACSI NAL unit is 
   contained in an STAP-B, MTAP16, MTAP24, or NI-MTAP with the J field 
   equal to 1. 

   The values of the fields in PACSI NAL unit MUST be set as follows.   

   o  The F bit MUST be set to 1 if the F bit in at least one of the 
      remaining NAL units in the aggregation packet is equal to 1 (when 
      the PACSI NAL unit is included in an aggregation packet) or if 
      the next non-PACSI NAL unit in transmission order has the F bit 
      equal to 1 (when the PACSI NAL unit is included in a single NAL 
      unit packet).  Otherwise, the F bit MUST be set to 0. 

   o  The NRI field MUST be set to the highest value of NRI field among 
      all the remaining NAL units in the aggregation packet (when the 
      PACSI NAL unit is included in an aggregation packet) or the value 
      of the NRI field of the next non-PACSI NAL unit in transmission 
      order (when the PACSI NAL unit is included in a single NAL unit 
      packet). 

 
 
Wenger, et al           Expires March 26, 2009                [Page 37] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   o  The Type field MUST be set to 30. 

   o  The R bit MUST be set to 1.  Receivers SHOULD ignore the value of 
      R. 

   o  The I bit MUST be set to 1 if the I bit of at least one of the 
      remaining NAL units in the aggregation packet is equal to 1 (when 
      the PACSI NAL unit is included in an aggregation packet) or if 
      the I bit of the next non-PACSI NAL unit in transmission order is 
      equal to 1 (when the PACSI NAL unit is included in a single NAL 
      unit packet).  Otherwise, the I bit MUST be set to 0. 

   o  The PRID field MUST be set to the lowest value of the PRID values 
      of the remaining NAL units in the aggregation packet (when the 
      PACSI NAL unit is included in an aggregation packet) or the PRID 
      value of the next non-PACSI NAL unit in transmission order (when 
      the PACSI NAL unit is included in a single NAL unit packet). 

   o  The N bit MUST be set to 1 if the N bit of all the remaining NAL 
      units in the aggregation packet is equal to 1 (when the PACSI NAL 
      unit is included in an aggregation packet) or if the N bit of the 
      next non-PACSI NAL unit in transmission order is equal to 1 (when 
      the PACSI NAL unit is included in a single NAL unit packet).  
      Otherwise, the N bit MUST be set to 0. 

   o  The DID field MUST be set to the lowest value of the DID values 
      of the remaining NAL units in the aggregation packet (when the 
      PACSI NAL unit is included in an aggregation packet) or the DID 
      value of the next non-PACSI NAL unit in transmission order (when 
      the PACSI NAL unit is included in a single NAL unit packet). 

   o  The QID field MUST be set to the lowest value of the QID values 
      of the remaining NAL units with the lowest value of DID in the 
      aggregation packet (when the PACSI NAL unit is included in an 
      aggregation packet) or the QID value of the next non-PACSI NAL 
      unit in transmission order (when the PACSI NAL unit is included 
      in a single NAL unit packet). 

   o  The TID field MUST be set to the lowest value of the TID values 
      of the remaining NAL units with the lowest value of DID in the 
      aggregation packet (when the PACSI NAL unit is included in an 
      aggregation packet) or the TID value of the next non-PACSI NAL 
      unit in transmission order (when the PACSI NAL unit is included 
      in a single NAL unit packet). 



 
 
Wenger, et al           Expires March 26, 2009                [Page 38] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   o  The U bit MUST be set to 1 if the U bit of at least one of the 
      remaining NAL units in the aggregation packet is equal to 1 (when 
      the PACSI NAL unit is included in an aggregation packet) or if 
      the U bit of the next non-PACSI NAL unit in transmission order is 
      equal to 1 (when the PACSI NAL unit is included in a single NAL 
      unit packet).  Otherwise, the U bit MUST be set to 0. 

   o  The D bit MUST be set to 1 if the D value of all the remaining 
      NAL unit in the aggregation packet is equal to 1 (when the PACSI 
      NAL unit is included in an aggregation packet) or if the D bit of 
      the next non-PACSI NAL unit in transmission order is equal to 1 
      (when the PACSI NAL unit is included in a single NAL unit 
      packet).  Otherwise, the D bit MUST be set to 0. 

   o  The O bit MUST be set to 1 if the O bit of at least one of the 
      remaining NAL units in the aggregation packet is equal to 1 (when 
      the PACSI NAL unit is included in an aggregation packet) or if 
      the O bit of the next non-PACSI NAL unit in transmission order is 
      equal to 1 (when the PACSI NAL unit is included in a single NAL 
      unit packet).  Otherwise, the O bit MUST be set to 0. 

   o  The RR field MUST be set to "11" (in binary form).  Receivers 
      SHOULD ignore the value of RR. 

   o  If the X bit is equal to 1, the bits A, P, and C are specified as 
      below.  Otherwise, the bits A, P, and C are unspecified, and 
      receivers SHOULD ignore the values of these bits.  The X bit 
      SHOULD be identical for all the PACSI NAL units in all the RTP 
      sessions carrying the same SVC bitstream. 

   o  If the Y bit is equal to 1, the OPTIONAL fields TL0PICIDX and 
      IDRPICID MUST be present and specified as below, and the bits S 
      and E are also specified as below.  Otherwise, the fields 
      TL0PICIDX and IDRPICID MUST NOT be present, while the S and E 
      bits are unspecified and receivers SHOULD ignore the values of 
      these bits.  The Y bit MUST be identical for all the PACSI NAL 
      units in all the RTP sessions carrying the same SVC bitstream. 

   o  If the T bit is equal to 1, the OPTIONAL field DONC MUST be 
      present and specified as below.  Otherwise, the field DONC MUST 
      NOT be present.  The field T MUST be equal to 0 if the PACSI NAL 
      unit is contained in an STAP-B, MTAP16, MTAP24, or NI-MTAP with 
      the J field equal to 1. 




 
 
Wenger, et al           Expires March 26, 2009                [Page 39] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   o  The A bit MUST be set to 1 if at least one of the remaining NAL 
      units in the aggregation packet belongs to an anchor layer 
      representation (when the PACSI NAL unit is included in an 
      aggregation packet) or if the next non-PACSI NAL unit in 
      transmission order belongs to an anchor layer representation 
      (when the PACSI NAL unit is included in a single NAL unit 
      packet).  Otherwise, the A bit MUST be set to 0. 

      Informative note: The A bit indicates whether CGS or spatial 
      layer switching at a non-IDR layer representation (a layer 
      representation with nal_unit_type not equal to 5 and idr_flag not 
      equal to 1) can be performed.  With some picture coding 
      structures a non-IDR intra layer representation can be used for 
      random access.  Compared to using only IDR layer representations, 
      higher coding efficiency can be achieved.  The H.264/AVC or SVC 
      solution to indicate the random accessibility of a non-IDR intra 
      layer representation is using a recovery point SEI message.  The 
      A bit offers direct access to this information, without having to 
      parse the recovery point SEI message, which may be buried deeply 
      in an SEI NAL unit.  Furthermore, the SEI message may or may not 
      be present in the bitstream. 

   o  The P bit MUST be set to 1 if all the remaining NAL units in the 
      aggregation packet have redundant_pic_cnt greater than 0 (when 
      the PACSI NAL unit is included in an aggregation packet) or the 
      next non-PACSI NAL unit in transmission order has 
      redundant_pic_cnt greater than 0 (when the PACSI NAL unit is 
      included in a single NAL unit packet).  Otherwise, the P bit MUST 
      be set to 0. 

      Informative note: The P bit indicates whether a packet can be 
      discarded because it contains only redundant slice NAL units.  
      Without this bit, the corresponding information can be obtained 
      from the syntax element redundant_pic_cnt, which is contained in 
      the variable-length coded slice header. 

   o  The C bit MUST be set to 1 if at least one of the remaining NAL 
      units in the aggregation packet belongs to an intra layer 
      representation (when the PACSI NAL unit is included in an 
      aggregation packet) or if the next non-PACSI NAL unit in 
      transmission order belongs to an intra layer representation (when 
      the PACSI NAL unit is included in a single NAL unit packet).  
      Otherwise, the C bit MUST be set to 0. 

      Informative note: The C bit indicates whether a packet contains 
      intra slices, which may be the only packets to be forwarded, 
      e.g., when the network conditions are particularly adverse. 
 
 
Wenger, et al           Expires March 26, 2009                [Page 40] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   o  The S bit MUST be set to 1, if the first NAL unit following the 
      PACSI NAL unit in an aggregation packet is the first VCL NAL 
      unit, in decoding order, of a layer representation (when the 
      PACSI NAL unit is included in an aggregation packet) or if the 
      next non-PACSI NAL unit in transmission order is the first VCL 
      NAL unit, in decoding order, of a layer representation(when the 
      PACSI NAL unit is included in a single NAL unit packet).  
      Otherwise, the S bit MUST be set to 0. 

   o  The E bit MUST be set to 1, if the last NAL unit following the 
      PACSI NAL unit in an aggregation packet is the last VCL NAL unit, 
      in decoding order, of a layer representation (when the PACSI NAL 
      unit is included in an aggregation packet) or if the next non-
      PACSI NAL unit in transmission order is the last VCL NAL unit, in 
      decoding order, of a layer representation (when the PACSI NAL 
      unit is included in a single NAL unit packet).  Otherwise, the E 
      field MUST be set to 0. 

      Informative note: In an aggregation packet it is always possible 
      to detect the beginning or end of a layer representation by 
      detecting changes in the values of dependency_id, quality_id, and 
      temporal_id in NAL unit headers, except from the first and last 
      NAL units of a packet.  The S or E bits are used to provide this 
      information, for both signal NAL unit and aggregation packets, so 
      that previous or following packets do not have to be examined.  
      This enables MANEs to detect slice loss and take proper action 
      such as requesting a retransmission as soon as possible, as well 
      as to allow efficient playout buffer handling similarly to the M 
      bit present in the RTP header.  The M bit in the RTP header still 
      indicates the end of an access unit, not the end of a layer 
      representation. 

   o  When present, the TL0PICIDX field MUST be set to equal to 
      tl0_dep_rep_idx as specified in Annex G of [H.264] for the layer 
      representation containing the first NAL unit following the PACSI 
      NAL unit in the aggregation packet (when the PACSI NAL unit is 
      included in an aggregation packet) or containing the next non-
      PACSI NAL unit in transmission order (when the PACSI NAL unit is 
      included in a single NAL unit packet). 

   o  When present, the IDRPICID field MUST be set to equal to 
      effective_idr_pic_id as specified in Annex G of [H.264] for the 
      layer representation containing the first NAL unit following the 
      PACSI NAL unit in the aggregation packet (when the PACSI NAL unit 
      is included in an aggregation packet) or containing the next non-
      PACSI NAL unit in transmission order (when the PACSI NAL unit is 
      included in a single NAL unit packet). 
 
 
Wenger, et al           Expires March 26, 2009                [Page 41] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

      Informative note: The TL0PICIDX and IDRPICID fields enable the 
      detection of the loss of layer representations in the most 
      important temporal layer (with temporal_id equal to 0) by 
      receivers as well as MANEs.  SVC provides a solution that uses 
      SEI messages, which are harder to parse and may or may not be 
      present in the bitstream.  When the PACSI NAL unit is part of an 
      NI-MTAP packet, it is possible to infer the correct values of 
      tl0_dep_rep_idx and idr_pic_id for all layer representations 
      contained in the NI-MTAP by following the rules that specify how 
      these parameters are set as given in Annex G of [H.264] and by 
      detecting the different layer representations contained in the 
      NI-MTAP packet by detecting changes in the values of 
      dependency_id_, quality_id, and temporal_id in the NAL unit 
      headers as well as using the S and E flags.  The only exception 
      is if NAL units of an IDR picture are present in the NI-MTAP in a 
      position other than the first NAL unit following the PACSI NAL 
      unit, in which case the value of idr_pic_id cannot be inferred.   
      In this case the NAL unit has to be partially parsed to obtain 
      the idr_pic_id.  Note that, due to the large size of IDR 
      pictures, their inclusion in an NI-MTAP, and especially in a 
      position other than the first NAL unit following the PACSI NAL 
      unit may be neither practical nor useful. 

   o  When present, the field DONC indicates the Cross-Session Decoding 
      Order Number (CS-DON) for the first of the remaining NAL units in 
      the aggregation packet (when the PACSI NAL unit is included in an 
      aggregation packet) or the CS-DON of the next non-PACSI NAL unit 
      in transmission order (when the PACSI NAL unit is included in a 
      single NAL unit packet).  CS-DON is further discussed in Section 
      4.11. 

   The PACSI NAL unit MAY include a subset of the SEI NAL units 
   associated with the access unit to which the first non-PACSI NAL 
   unit in the aggregation packet belongs, and MUST NOT contain SEI NAL 
   units associated with any other access unit.  

      Informative note:  In H.264/AVC and SVC, within each access unit, 
      SEI NAL units must appear before any VCL NAL unit in decoding 
      order.  Therefore, without using PACSI NAL units, SEI messages 
      are typically only conveyed in the first of the packets carrying 
      an access unit.  Senders may repeat SEI NAL units in PACSI NAL 
      units, so that they are repeated in more than one packet and thus 
      increase robustness against packet losses.  Receivers may use the 
      repeated SEI messages in place of missing SEI messages. 

   For a PACSI NAL unit included in an aggregation packet, an SEI 
   message SHOULD NOT be included in the PACSI NAL unit and also 
 
 
Wenger, et al           Expires March 26, 2009                [Page 42] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   included in one of the remaining NAL units contained in the same 
   aggregation packet. 

4.10 Empty NAL unit 

   An Empty NAL unit MAY be included in a single NAL unit packet, an 
   STAP-A or an NI-MTAP packet.  Empty NAL units MUST have an RTP 
   timestamp (when transported in a single NAL unit packet) or NALU-
   time (when transported in an aggregation packet) that is associated 
   with an access unit for which there exists at least one NAL unit of 
   type 1, 5, or 20.  When MST is used, the type 1, 5, or 20 NAL unit 
   may be in a different RTP session.   Empty NAL units may be used in 
   the decoding order recovery process of the NI-T mode as described in 
   Section 5.2.1. 

   The packet structure is shown in the following figure.  

         +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
         |F|NRI|  type   | Subtype |J|K|L| 
         +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

                       Figure 4  Empty NAL unit structure. 

   The fields MUST be set as follows: 

   -  F MUST be equal to 0 

   -  NRI MUST be equal to 3 

   -  Type MUST be equal to 31 

   -  Subtype MUST be equal to 1 

   -  J MUST be equal to 0 

   -  K MUST be equal to 0 

   -  L MUST be equal to 0 

4.11 Decoding Order Number (DON) 

   The DON concept is introduced in RFC 3984 and is used to recover the 
   decoding order when interleaving is used within a single session.  
   Section 5.5 of [RFC3984] applies when using SST. 

   When using MST, it is necessary to recover the decoding order across 
   the various RTP sessions regardless if interleaving is used or not.  
 
 
Wenger, et al           Expires March 26, 2009                [Page 43] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   In addition to the timestamp mechanism described later on, the CS-
   DON mechanism is an extension of the DON facility that can be used 
   for this purpose, and is defined in the following section.  

4.11.1 Cross-Session DON (CS-DON) for Multi-Session Transmission 

   The Cross-Session Decoding Order Number (CS-DON) is a number that 
   indicates the decoding order of NAL units across all RTP sessions 
   involved in MST.  It is similar to the DON concept in RFC 3984, but 
   contrary to RFC 3984 where the DON was used only for interleaved 
   packetization, in this memo it is used not only in the interleaved 
   MST mode (I-C) but also in two of the non-interleaved MST modes as 
   well (NI-C and NI-TC).  

   When the NI-C or NI-TC MST modes are in use, the packetization of 
   each session MUST be as specified in Section 5.2.2.  In PACSI NAL 
   units the CS-DON value is explicitly coded in the field DONC.  For 
   non-PACSI NAL units the CS-DON value is derived as follows.  Let SN 
   indicate the RTP sequence number of a packet. 

   o  For each non-PACSI NAL unit carried in a session using the single 
      NAL unit session packetization mode, the CS-DON value of the NAL 
      unit is equal to (DONC_prev_PACSI + SN_diff - 1) % 65536, wherein 
      "%" is the modulo operation, DONC_prev_PACSI is the DONC value of 
      the previous PACSI NAL unit with the same NALU-time as the 
      current NAL unit, and SN_diff is calculated as follows: 

                 if SN1 > SN2, SN_diff = SN1 - SN2 
                 else SN_diff = SN2 + 65536 - SN1 

     where SN1 and SN2 are the SNs of the current NAL unit and the 
     previous PACSI NAL unit with the same NALU-time, respectively. 

   o  For non-PACSI NAL units carried in a session using the non-
      interleaved session packetization mode, the CS-DON value of each 
      non-PACSI NAL unit is derived as follows. 

         For a non-PACSI NAL unit in a single NAL unit packet, the 
          following applies. 

              If the previous PACSI NAL unit is contained in a single 
               NAL unit packet, the CS-DON value of the NAL unit is 
               calculated as above; 




 
 
Wenger, et al           Expires March 26, 2009                [Page 44] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

              otherwise (the previous PACSI NAL unit is contained in 
               an STAP-A packet), the CS-DON value of the NAL unit is 
               calculated as above, with DONC_prev_PACSI being replaced 
               by the CS-DON value of the previous non-PACSI NAL unit 
               in decoding order (i.e., the CS-DON value of the last 
               NAL unit of the STAP-A packet). 

         For a non-PACSI NAL unit in an STAP-A packet, the following 
          applies. 

              If the non-PACSI NAL unit is the first non-PACSI NAL 
               unit in the STAP-A packet, the CS-DON value of the NAL 
               unit is equal to DONC of the PACSI NAL unit in the STAP-
               A packet; 

              otherwise (the non-PACSI NAL unit is not the first non-
               PACSI NAL unit in the STAP-A packet), the CS-DON value 
               of the NAL unit is equal to: (the CS-DON value of the 
               previous non-PACSI NAL unit in decoding order + 1) % 
               65536, wherein "%" is the modulo operation. 

         For a non-PACSI NAL unit in a number of FU-A packets, the CS-
          DON value of the NAL unit is calculated the same way as when 
          the single NAL unit session packetization mode is in use, 
          with SN1 being the SN value of the first FU-A packet. 

         For a non-PACSI NAL unit in an NI-MTAP packet, the CS-DON 
          value is equal to the value of the DON field of the non-
          interleaved multi-time aggregation unit.  

   When the I-C MST packetization mode is in use, the DON values 
   derived according to RFC 3984 for all the NAL units in each of the 
   RTP sessions MUST indicate CS-DON values. 

5. Packetization Rules 

   Section 6 of [RFC3984] applies in this memo, with the following 
   additions. 

5.1 Packetization Rules for Single-Session Transmission 

   All receivers MUST support the single NAL unit packetization mode to 
   provide backward compatibility to endpoints supporting only the 
   single NAL unit mode of RFC 3984.  However, the use of single NAL 
   unit packetization mode (packetization-mode equal to 0) SHOULD be 
   avoided whenever possible, because encapsulating NAL units of small 
   sizes in their own packets (e.g., small NAL units containing 
 
 
Wenger, et al           Expires March 26, 2009                [Page 45] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   parameter sets, prefix NAL units, or SEI messages) is less efficient 
   due to the packet header overhead. 

   All receivers MUST support the non-interleaved mode of [RFC3984]. 

      Informative note: The non-interleaved mode does allow an 
      application to encapsulate a single NAL unit in a single RTP 
      packet.  Historically, the single NAL unit mode has been included 
      into [RFC3984] only for compatibility with ITU-T Rec. H.241 Annex 
      A [H.241].  There is no point in carrying this historic ballast 
      towards a new application space such as the one provided with 
      SVC.  The implementation complexity increase for supporting the 
      additional mechanisms of the non-interleaved mode (namely STAP-A 
      and FU-A) is minor, whereas the benefits are significant.  As a 
      result, STAP-A and FU-A implementation is required. 

   A NAL unit of small size SHOULD be encapsulated in an aggregation 
   packet together with one or more other NAL units.  For example, non-
   VCL NAL units such as access unit delimiters, parameter sets, or SEI 
   NAL units are typically small. 

   A prefix NAL unit and the NAL unit with which it is associated, and 
   which follows the prefix NAL unit in decoding order, SHOULD be 
   included in the same aggregation packet whenever an aggregation 
   packet is used for the associated NAL unit, unless this would 
   violate session MTU constraints or if fragmentation units are used 
   for the associated NAL unit. 

      Informative note: Although the prefix NAL unit is ignored by an 
      H.264/AVC decoder, it is necessary in the SVC decoding process.  
      Given the small size of the prefix NAL unit, it is best if it is 
      transported in the same RTP packet as its associated NAL unit. 

   When only an H.264/AVC compatible subset of the SVC base layer is 
   transmitted in an RTP session, the subset MUST be encapsulated 
   according to RFC 3984.  This way, an RFC 3984 receiver will be able 
   to receive the H.264/AVC compatible bitstream subset. 

   When a set of layers including one or more SVC enhancement layers is 
   transmitted in an RTP session, the set SHOULD be carried in one RTP 
   stream that SHOULD be encapsulated according to this memo. 

5.2 Packetization Rules for Multi-Session Transmission 

   When MST is used, the packetization rules specified in Section 5.1 
   still apply.  In addition, the following packetization rules MUST be 
   followed, to ensure that decoding order of NAL units carried in the 
 
 
Wenger, et al           Expires March 26, 2009                [Page 46] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   sessions can be correctly recovered for each of the MST 
   packetization modes using the de-packetization process specified in 
   Section 6.2. 

   The NI-T and NI-TC modes both use timestamps to recover the decoding 
   order.  In order to be able to do so, it is necessary for the RTP 
   packet stream to contain data for all sampling instances of a given 
   RTP session in all enhancement RTP sessions that depend on the given 
   RTP session.  The NI-C and I-C modes do not have this limitation, 
   and use the CS-DON values as a means to explicitly indicate decoding 
   order, either directly coded in PACSI NAL units, or inferred from 
   them using the packetization rules.  It is noted that the NI-TC mode 
   offers both alternatives and it is up to the receiver to select 
   which one to use. 

5.2.1 NI-T/NI-TC Packetization Rules 

   When using the NI-T mode and a PACSI NAL unit is present, the T bit 
   MUST be equal to 0, i.e., the DONC field MUST NOT be present. 

   When using the NI-T mode, the optional parameters sprop-mst-remux-
   buf-size, sprop-remux-buf-req, remux-buf-cap, sprop-remux-init-buf-
   time, sprop-mst-max-don-diff MUST NOT be present. 

   When the NI-T or NI-TC MST mode is in use, the following applies. 

   If one or more NAL units of an access unit of sampling time instance 
   t is present in RTP session A, then one or more NAL units of the 
   same access unit MUST be present in any enhancement RTP session 
   which depends on RTP session A.  

      Informative note: This rules may require the insertion of NAL 
      units, typically when temporal scalability is used, i.e., an 
      enhancement RTP session does not contain any NAL units for an 
      access unit with a particular NTP timestamp (media timestamp), 
      which however is present in a lower enhancement RTP session or 
      the base RTP session. There are two ways to insert additional NAL 
      units in order to satisfy this rule: 

      - One option for adding additional NAL units is to use Empty NAL 
      units (defined in Section 4.10), which can be used by the process 
      described in Section 6.2.1 for the access unit re-ordering 
      process. 

      - Additional NAL units may also be added by the encoder itself, 
      for example by transmitting coded data that simply instruct the 

 
 
Wenger, et al           Expires March 26, 2009                [Page 47] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

      decoder to repeat the previous picture.  This option, however, 
      may be difficult to use with pre-encoded content. 

   If a packet must be inserted for satisfying the above rule, the NTP 
   timestamp of such an inserted packet must be set equal to the NTP 
   timestamp of a packet of the access unit present in any lower 
   enhancement RTP session and the base RTP session.  This is easy to 
   accomplish if the NAL unit or the packet can be inserted at the time 
   of the RTP stream generation, since the media timestamp (NTP 
   timestamp) must be the same for the inserted packet and the packet 
   of the corresponding access unit.  If there is no knowledge of the 
   media time at RTP stream generation or if the RTP streams are not 
   generated at the same instance, this can be also applied later in 
   the transmission process.  In this case the NTP timestamp of the 
   inserted packet can be calculated as follows. 

   Assume that a packet A2 of an access unit with RTP timestamp TS_A2 
   is present in base RTP session A, and that no packet of that access 
   unit is present in enhancement RTP session B, as shown in Figure 5.  
   Thus a packet B2 must be inserted into session B following the rule 
   above.  The most recent RTCP sender report in session A carries NTP 
   timestamp NTP_A and the RTP timestamp TS_A.  The sender report in 
   session B with a lower NTP timestamp than NTP_A is NTP_B, and 
   carries the RTP timestamp TS_B. [Ed. (AE): What if there is no such 
   previous report?]  [Ed. (AE): Should we require that if one session 
   sends an SR, then all sessions must transmit an SR at the same time 
   even at that time there is no RTP packet to transmit for some of the 
   sessions? This would solve this problem.] 

     RTP  session B:..B0........B1........(B2)...................... 

     RTCP session B:......SR(NTP_B,TS_B)............................ 

     RTP  session A:..A0........A1........A2........................ 

     RTCP session A:..................SR(NTP_A,TS_A)................ 

     -----------------|--x------|-----x---|------------------------> 
                                                              NTP time 
     --------------------+<---------->+<->+------------------------> 
                               t1       t2              RTP TS(B) time 

           Figure 5  Calculation of RTP timestamp for packet insertion 
                       in an enhancement layer RTP session   

   The vertical bars ("|")in the NTP timeline in the figure above 
   indicate that access unit data is present in at least one of the 
 
 
Wenger, et al           Expires March 26, 2009                [Page 48] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   sessions. The "x" marks indicate the times of the sender reports. 
   The RTP timestamp time line for session B, shown right below the NTP 
   time line, indicates two time segments, t1 and t2. t1 is the time 
   difference between the sender reports between the two sessions, 
   expressed in RTP timestamp clock ticks, and t2 is the time 
   difference from the session A sender report to the A2 packet, again 
   expressed in RTP timestamp clock ticks. The sum of these differences 
   is added to the RTP timestamp of the session report from session B 
   in order to derive the correct RTP timestamp for the inserted packet 
   B2.  In other words: 

     TS_B2 = TS_B + t1 + t2 

   Let toRTP() be a function that calculates the RTP time difference 
   (in clock ticks of the used clock) given an NTP timestamp 
   difference, and effRTPdiff() be a function that calculates the 
   effective difference between two timestamps, including wraparounds: 

     effRTPdiff( ts1, ts2 ):  

         if( ts1 <= ts2 ) then  
             effRTPdiff := ts1-ts2 
         else  
             effRTPDiff := (4294967296 + ts2) - ts1 

   We have: 

     t1 = toRTP(NTP_A - NTP_B)  and  t2 = effRTPdiff(TS_A2, TS_A) 

   Hence in order to generate the RTP timestamp TS_B2 for the inserted 
   packet B2, the RTP timestamp for packet B2 TS_B2 can be calculated 
   as follows.   

     TS_B2 =  TS_B + toRTP(NTP_A - NTP_B) +  effRTPdiff(TS_A2, TS_A)  

    

5.2.2 NI-C/NI-TC Packetization Rules 

   When the NI-C or NI-TC MST mode is in use, the following applies for 
   each of the RTP sessions. 

   o  For each single NAL unit packet containing a non-PACSI NAL unit, 
      the previous packet, if present, MUST have the same RTP timestamp 
      as the single NAL unit packet, and the following applies. 


 
 
Wenger, et al           Expires March 26, 2009                [Page 49] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

         If the NALU-time of the non-PACSI NAL unit is not equal to the 
          NALU-time of the previous non-PACSI NAL unit in decoding 
          order, the previous packet MUST contain a PACSI NAL unit 
          containing the DONC field. 

   o  In an STAP-A packet the first NAL unit in the STAP-A packet MUST 
      be a PACSI NAL unit containing the DONC field. 

   o  For an FU-A packet the previous packet MUST have the same RTP 
      timestamp as the FU-A packet, and the following applies.  

         If the FU-A packet is the start of the fragmented NAL unit, 
          the following applies; 

              If the NALU-time of the fragmented NAL unit is not equal 
               to the NALU-time of the previous non-PACSI NAL unit in 
               decoding order, the previous packet MUST contain a PACSI 
               NAL unit containing the DONC field; 

              Otherwise (the NALU-time of the fragmented NAL unit is 
               equal to the NALU-time of the previous non-PACSI NAL 
               unit in decoding order), the previous packet MAY contain 
               a PACSI NAL unit containing the DONC field. 

         Otherwise if the FU-A packet is the end of the fragmented NAL 
          unit, the following applies. 

              If the next non-PACSI NAL unit in decoding order has 
               NALU-time equal to the NALU-time of the fragmented NAL 
               unit, and is carried in a number of FU-A packets or a 
               single NAL unit packet, the next packet MUST be a single 
               NAL unit packet containing a PACSI NAL unit containing 
               the DONC field. 

              Otherwise (the FU-A packet is neither the start nor the 
               end of the fragmented NAL unit), the previous packet 
               MUST be a FU-A packet. 

   o  For each single NAL unit packet containing a PACSI NAL unit, if 
      present, the PACSI NAL unit MUST contain the DONC field. 

   o  When the optional media type parameter sprop-mst-csdon-always-
      present is equal to 1, the session packetization mode in use MUST 
      be the Non-Interleaved Mode, and only STAP-A and NI-MTAP packets 
      can be used.  


 
 
Wenger, et al           Expires March 26, 2009                [Page 50] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

5.2.3 I-C Packetization Rules 

   When the I-C MST packetization mode is in use, the following 
   applies. 

   o  When a PACSI NAL unit is present, the T bit MUST be equal to 0, 
      i.e., the DONC field is not present, and the Y bit MUST be equal 
      to 0, i.e., the TL0PICIDX and IDRPICID are not present. 

5.2.4 Packetization Rules for Non-VCL NAL Units 

   NAL units which do not directly encode video slices are known in 
   H.264 as non-VCL NAL units.  Non-VCL units that are only used by, or 
   only relevant to, enhancement RTP sessions SHOULD be sent in the 
   lowest session to which they are relevant. 

   Some senders, however, such as those sending pre-encoded data, may  
   be unable to easily determine which non-VCL units are relevant to 
   which session.  Thus, non-VCL NAL units MAY, instead, be sent in a 
   session that the session using these non-VCL NAL units depends on 
   (e.g., the base RTP session).  

   If a non-VCL unit is relevant to more than one RTP session, neither 
   of which depends on the other(s), the NAL unit MAY be sent in 
   another session which all these sessions depend on.  

5.2.5 Packetization Rules for Prefix NAL Units 

   Section 5.1 of this memo applies, with the following addition.  If 
   the base layer is sent in a base RTP session using RFC 3984, prefix 
   NAL units MAY be sent in the lowest enhancement RTP session rather 
   than in the base RTP session. 

6. De-Packetization Process 

6.1 De-Packetization Process for Single-Session Transmission 

   For single-session transmission, where a single RTP session is used, 
   the de-packetization process specified in Section 7 of [RFC3984] 
   applies.  

6.2 De-Packetization Process for Multi-Session Transmission 

   For multi-session transmission, where more than one RTP session is 
   used to receive data from the same SVC bitstream, the de-
   packetization process is specified as follows. 

 
 
Wenger, et al           Expires March 26, 2009                [Page 51] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   As for a single RTP session, the general concept behind the de-
   packetization process is to reorder NAL units from transmission 
   order to the NAL unit decoding order. 

   The sessions to be received MUST be identified by mechanisms 
   specified in [I-D.ietf-mmusic-decoding-dependency].  An enhancement 
   RTP session typically contains an RTP stream that depends on at 
   least one other RTP session, as indicated by mechanisms defined in 
   [I-D.ietf-mmusic-decoding-dependency].  A lower RTP session to an 
   enhancement RTP session is an RTP session which the enhancement RTP 
   session depends on.  The lowest RTP session for a receiver is the 
   base RTP session, which does not depend on any other RTP session 
   received by the receiver.  The highest RTP session for a receiver is 
   the RTP session which no other RTP session received by the receiver 
   depends on. 

   For each of the RTP sessions, the RTP reception process as specified 
   in RFC 3550 is applied.  Then the received packets are passed into 
   the payload de-packetization process as defined in this memo. 

   The decoding order of the NAL units carried in all the associated 
   RTP sessions is then recovered by applying one of the following 
   subsections, depending on which of the MST packetization modes is in 
   use. 

6.2.1 Decoding Order Recovery for the NI-T and NI-TC Modes 

   The following process MUST be applied when the NI-T packetization 
   mode is in use.  The following process MAY be applied when the NI-TC 
   packetization mode is in use. 

   The process is based on RTP session dependency signaling, RTP 
   sequence numbers, and timestamps. 

   The decoding order of NAL units within an RTP packet stream in RTP 
   session is given by the ordering of sequence numbers SN of the RTP 
   packets that contain the NAL units, and the order of appearance of 
   NAL units within a packet.  

   Timing information according to the media timestamp TS, e.g., the 
   NTP timestamp as derived from the RTP timestamp of an RTP packet is 
   associated with all NAL units contained in the same RTP packet 
   received in an RTP session.   




 
 
Wenger, et al           Expires March 26, 2009                [Page 52] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

         Informative note: It is possible to use the media timestamp TS 
         directly (i.e., without having to first convert it to an NTP 
         timestamp), if every RTP session uses the same random initial 
         value for the timestamp [Lennox]. 

   For NI-MTAP packets the NALU-time is derived for each contained NAL 
   unit by using the "TS offset" value in the NI-MTAP packet as defined 
   in Section 4.10, and is used instead of the RTP packet timestamp to 
   derive the media timestamp, e.g., using the NTP wall clock as 
   provided via RTCP sender reports.  NAL units contained in 
   fragmentation packets are handled as defragmented, entire NAL units 
   with their own media timestamps.  All NAL units associated with the 
   same value of media timestamp TS are part of the same access unit 
   AU(TS).Any Empty NAL units SHOULD be kept as, effectively, access 
   unit indicators in the re-ordering process.  Empty NAL units and 
   PACSI NAL units SHOULD be removed before passing access unit data to 
   the decoder. 

         Informative note: These Empty NAL units are used to associate 
         NAL units present in other RTP sessions with RTP sessions not 
         containing any data for an access unit of a particular time 
         instance.  They act as access unit indicators in sessions that 
         would otherwise contain no data for the particular access 
         unit.  The presence of these NAL units is ensured by the 
         packetization rules in Section 5.2.1. 

   It is assumed that the receiver has established an operation point 
   (DID, QID, and TID values), and has identified the highest 
   enhancement RTP session for this operation point.  The decoding 
   order of NAL units from multiple RTP streams in multiple RTP 
   sessions MUST be recovered into a single sequence of NAL units, 
   grouped into access units, by performing any process equivalent to 
   the following steps: 

       o The process should be started with the NAL units received in 
          the highest RTP session with the first media timestamp TS 
          available in the session's (de-jittering) buffer.  It is 
          assumed, that packets in the de-jittering buffer are already 
          stored in RTP sequence number order. 

       o  Collect all NAL units associated with the same value of media 
          timestamp TS, starting from the highest RTP session, from all 
          the (de-jittering) buffers of the received RTP sessions.  The 
          collected NAL units will be those associated with the access 
          unit AU(TS).  


 
 
Wenger, et al           Expires March 26, 2009                [Page 53] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

       o  Place the collected NAL units in the order of session 
          dependency as derived by the dependency indication provided 
          by mechanisms described in Section 7.2.3, starting from the 
          lowest RTP session. 

       o  Place the session ordered NAL units in decoding order within 
          the particular access unit by satisfying the NAL unit 
          ordering rules for SVC access units, as described in the 
          informative algorithm provided in Section 6.2.1.1. 

       o  Remove NI-MTAP and any PACSI NAL units from the access unit 
          AU(TS). 

       o  The access units can then be transferred to the decoder.  
          Access units AU(TS) are transferred to the decoder in the 
          order of appearance (given by the order of RTP sequence 
          numbers) of media timestamp values TS in the highest RTP 
          session associated with access unit AU(TS). 

            Informative Note: Due to packet loss it is possible that 
            not all sessions may have NAL units present for the media 
            timestamp value TS present in the highest RTP session.  In 
            such a case an algorithm may:  
            a) proceed to the next complete access unit with NAL units 
            present in all the received RTP sessions; or  
            b) consider a new highest RTP session, the highest RTP 
            session for which the access unit is complete,  and apply 
            the process above.  The algorithm may return to the 
            original highest RTP session when a complete and error-free 
            access unit that contains NAL units in all the sessions is 
            received.  

   Informative example: 

   The example shown in Figure 6 refers to three RTP sessions A, B and 
   C containing an SVC bitstream transmitted as 3 sources.  In the 
   example, the dependency signaling (described in Section 7.2.3) 
   indicates that session A is the base RTP session, B is the first 
   enhancement RTP session and depends on A, and C is the second 
   enhancement RTP session and depends on A and B.  A hierarchical 
   picture coding prediction structure is used, in which Session A has 
   the lowest frame rate and Session B and C have the same but higher 
   frame rate. 

   The figure shows NAL units contained in RTP packets which are stored 
   in the de-jittering buffer at the receiver for session de-
   packetization.  The NAL units are already re-ordered according to 
 
 
Wenger, et al           Expires March 26, 2009                [Page 54] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   their RTP sequence number order and, if within an aggregation 
   packet, according to the order of their appearance within the 
   aggregation packet.  The figure indicates for the received NAL units 
   the decoding order within the sessions, as well as the associated 
   media (NTP) timestamps ("TS[..]").  NAL units of the same access 
   unit within a session are grouped by "(.,.)" and share the same 
   media timestamp TS, which is shown at the bottom of the figure.  
   Note that the timestamps are not in increasing order since, in this 
   example, the decoding order is different from the output/display 
   order.  

   The process first proceeds to the NAL units associated with the 
   first media timestamp TS[1] present in the highest session C and 
   removes/ignores all preceding (in decoding order) NAL units to NAL 
   units with TS[1] in each of the de-jittering buffers of RTP sessions 
   A, B, and C.  Then, starting from session C, the first media 
   timestamp available in decoding order (TS [1]) is selected and NAL 
   units starting from RTP session A, and sessions B and C are placed 
   in order of the RTP session dependency (in the example for TS[1]: 
   first session B and then session C) into the access unit AU(TS[1]) 
   associated with media timestamp TS[1].  Then the next media 
   timestamp TS[3] in order of appearance in the highest RTP session C 
   is processed and the process described above is repeated.  Note that 
   there may be access units with no NAL units present, e.g., in the 
   lowest RTP session A (see, e.g., TS[1]).  With TS[8], the first 
   access unit with NAL units present in all the RTP sessions appears 
   in the buffers. 

    
   C: ------------(1,2)-(3,4)--(5)---(6)---(7,8)(9,10)-(11)--(12)---- 
        |     |     |     |     |     |      |    |     |      |      
   B: -(1,2)-(3,4)-(5)---(6)--(7,8)-(9,10)-(11)-(12)--(13,14)(15,15)- 
        |     |                 |     |                 |      |      
   A: -------(1)---------------(2)---(3)---------------(4)----(5)---- 
   ---------------------------------------------------decoding order--> 
    
   TS: [4]   [2]   [1]   [3]   [8]   [6]   [5]   [7]   [12]   [10]     
    
    
   Key: 
   A, B, C                - RTP sessions 
   Integer values in "()" - NAL unit decoding order within RTP session 
   "( )"                  - groups the NAL units of an access unit  
                            in an RTP session 

 
 
Wenger, et al           Expires March 26, 2009                [Page 55] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   "|"                    - indicates corresponding NAL units of the  
                            same access unit AU(TS[..]) in the RTP  
                            sessions 
   Integer values in "[]" - media timestamp (TS), sampling time  
                            as, e.g., derived from NTP timestamp  
                            associated to the access unit AU(TS[..])  
                            consisting of NAL units in the sessions  
                            above each TS value. 
    
           Figure 6  Example of decoding order recovery in multi-source 
                                  transmission. 

6.2.1.1 Informative Algorithm for NI-T Decoding Order Recovery within 
   an Access Unit 

   Within an access unit, the [H.264] specification (Sections 7.4.1.2.3 
   and G.7.4.1.2.3) constrains the valid decoding order of NAL units.  
   These constraints make it possible to reconstruct a valid decoding 
   order for the NAL units of an access unit based only on the order of 
   NAL units in each session, the NAL unit headers, and Supplemental 
   Enhancement Information message headers. 

   This section specifies an informative algorithm to reconstruct a 
   valid decoding order for NAL units within an access unit.  Other NAL 
   unit orderings may also be valid; however, any compliant NAL unit 
   ordering will describe the same video stream and ancillary data as 
   the one produced by this algorithm. 

   An actual implementation, of course, needs only to behave "as if" 
   this reordering is done.  In particular, NAL units which are 
   discarded by an implementation's decoding process do not need to be 
   reordered. 

   In this algorithm, NAL units within an access unit are first ordered 
   by NAL unit type, in the order specified in Table 12 below, except 
   from NAL unit type 14 which is handled specially as described in the 
   table.  NAL units of the same type are then ordered as specified for 
   the type, if necessary.  

   For the purposes of this algorithm, "session order" is the order of 
   NAL units implied by their transmission order within an RTP session.  
   For the Non-Interleaved and Single NAL unit modes, this is the RTP 
   sequence number order coupled with the order of NAL units within an 
   aggregation unit. 


 
 
Wenger, et al           Expires March 26, 2009                [Page 56] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

        Table 12  Ordering of NAL unit types within in Access Unit 

       Type    Description / Comments  
      ----------------------------------------------------------- 
        9      Access unit delimiter 

        7      Sequence parameter set 

        13     Sequence parameter set extension 

        15     Subset sequence parameter set 

        8      Picture parameter set 

        16-18  Reserved 

        6      Supplemental enhancement information (SEI) 

               If an SEI message with a first payload of 0 (Buffering 
               Period) is present, it must be the first SEI. 

               If SEI messages with a Scalable Nesting (30) payload and 
               a nested payload of 0 (Buffering Period) are present, 
               these then follow.  Such an SEI message with the 
               all_layer_representations_in_au_flag equal to 1 is 
               placed first, followed by any others, sorted in DQId 
               order by the highest DQId mentioned. 

               All other SEI messages follow in any order. 

        14     Prefix NAL unit in scalable extension 
        1      Coded slice of a non-IDR picture 
        5      Coded slice of an IDR picture 

               NAL units of type 1 or 5 will be sent within only a 
               single session for any given access unit.  They are 
               placed in session order.  (Note: Any given access unit 
               will contain only NAL units of type 1 or type 5, not 
               both.)  

               If NAL units of type 14 are present, every NAL unit of 
               type 1 or 5 is prefixed by a NAL unit of type 14.  
               (Note: Within an access unit, every NAL unit of type 14 
               is identical, so correlation of type 14 NAL units with 
               the other NAL units is not necessary.)  


 
 
Wenger, et al           Expires March 26, 2009                [Page 57] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

        14     Prefix NAL unit in scalable extension 
        12     Filler data 

               Any order of filler data units within an access unit is 
               valid.  

               If NAL units of type 14 are present, every filler data 
               NAL unit is prefixed by a NAL unit of type 14. 

        19     Coded slice of an auxiliary coded picture without 
               partitioning 

               These NAL units will be sent within only a single 
               session for any given access unit, and are placed in 
               session order. 

         20    Coded slice in scalable extension 
         21-23 Reserved 

               Type 20 NAL units are placed in DQId order, based on the 
               dependency_id and quality_id values in the slice's NAL 
               unit header extension.  Within each DQId, they are 
               placed in session order.  (Note: SVC slices with a given 
               DQId value will be sent on a single session for any 
               given access unit.) 

               Type 21-23 NAL units are placed immediately following 
               the non-reserved-type VCL NAL unit they follow in 
               session order. 

        10     End of sequence 

        11     End of stream 

         

6.2.2 Decoding Order Recovery for the NI-C, NI-TC and I-C Modes  

   The following process MUST be used when either the NI-C or I-C MST 
   packetization mode is in use.  The following process MAY be applied 
   when the NI-TC MST packetization mode is in use. 

   The RTP packets output from the RTP-level reception processing for 
   each session are placed into a remultiplexing buffer. 

   It is RECOMMENDED to set the size of the remultiplexing buffer (in 
   bytes) equal to or greater than the value of the sprop-remux-buf-req 
 
 
Wenger, et al           Expires March 26, 2009                [Page 58] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   media type parameter of the highest RTP session the receiver 
   receives. 

   The CS-DON value is calculated and stored for each NAL unit.  

         Informative note: The CS-DON value of a NAL unit may rely on 
         information carried in another packet than the packet 
         containing the NAL unit.  This happens, e.g., when the CS-DON 
         values need to be derived for non-PACSI NAL units contained in 
         single NAL unit packets, as the single NAL unit packets 
         themselves do not contain CS-DON information.  In this case, 
         when no packet containing required CS-DON information is 
         received for a NAL unit, this NAL unit has to be discarded by 
         the receiver as it cannot be fed to the decoder in the correct 
         order. When the optional media type parameter sprop-mst-csdon-
         always-present is equal to 1, no such dependency exists, i.e., 
         the CS-DON value of any particular NAL unit can be derived 
         solely according to information in the packet containing the 
         NAL unit, and therefore, the receiver does not need to discard 
         any received NAL units. 

   The receiver operation is described below with the help of the 
   following functions and constants: 

   o  Function AbsDON is specified in Section 8.1 of RFC 3984. 

   o  Function don_diff is specified in Section 5.5 of RFC 3984. 

   o  Constant N is the value of the OPTIONAL sprop-mst-remux-buf-size 
      media type parameter of the highest RTP session incremented by 1. 

   Initial buffering lasts until one of the following conditions is 
   fulfilled: 

   o  There are N or more VCL NAL units in the remultiplexing buffer. 

   o  If sprop-mst-max-don-diff of the highest RTP session is present, 
      don_diff(m,n) is greater than the value of sprop-mst-max-don-diff 
      of the highest RTP session, where n corresponds to the NAL unit 
      having the greatest value of AbsDON among the received NAL units 
      and m corresponds to the NAL unit having the smallest value of 
      AbsDON among the received NAL units. 

   o  Initial buffering has lasted for the duration equal to or greater 
      than the value of the OPTIONAL sprop-remux-init-buf-time media 
      type parameter of the highest RTP session. 

 
 
Wenger, et al           Expires March 26, 2009                [Page 59] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   The NAL units to be removed from the remultiplexing buffer are 
   determined as follows: 

   o  If the remultiplexing buffer contains at least N VCL NAL units, 
      NAL units are removed from the remultiplexing buffer and passed 
      to the decoder in the order specified below until the buffer 
      contains N-1 VCL NAL units. 

   o  If sprop-mst-max-don-diff of the highest RTP session is present, 
      all NAL units m for which don_diff(m,n) is greater than sprop-
      max-don-diff of the highest RTP session are removed from the 
      remultiplexing buffer and passed to the decoder in the order 
      specified below.  Herein, n corresponds to the NAL unit having 
      the greatest value of AbsDON among the NAL units in the 
      remultiplexing buffer. 

   The order in which NAL units are passed to the decoder is specified 
   as follows: 

   o  Let PDON be a variable that is initialized to 0 at the beginning 
      of the RTP sessions. 

   o  For each NAL unit associated with a value of CS-DON, a CS-DON 
      distance is calculated as follows.  If the value of CS-DON of the 
      NAL unit is larger than the value of PDON, the CS-DON distance is 
      equal to CS-DON - PDON.  Otherwise, the CS-DON distance is equal 
      to 65535 - PDON + CS-DON + 1. 

   o  NAL units are delivered to the decoder in increasing order of CS-
      DON distance.  If several NAL units share the same value of CS-
      DON distance, they can be passed to the decoder in any order. 

   o  When a desired number of NAL units have been passed to the 
      decoder, the value of PDON is set to the value of CS-DON for the 
      last NAL unit passed to the decoder. 

7. Payload Format Parameters 

   This section specifies the parameters that MAY be used to select 
   optional features of the payload format and certain features of the 
   bitstream.  The parameters are specified here as part of the media 
   type registration for the SVC codec.  A mapping of the parameters 
   into the Session Description Protocol (SDP) [RFC4566] is also 
   provided for applications that use SDP.  Equivalent parameters could 
   be defined elsewhere for use with control protocols that do not use 
   SDP. 

 
 
Wenger, et al           Expires March 26, 2009                [Page 60] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   Some parameters provide a receiver with the properties of the stream 
   that will be sent.  The names of all these parameters start with 
   "sprop" for stream properties.  Some of these "sprop" parameters are 
   limited by other payload or codec configuration parameters.  For 
   example, the sprop-parameter-sets parameter is constrained by the 
   profile-level-id parameter.  The media sender selects all "sprop" 
   parameters rather than the receiver.  This uncommon characteristic 
   of the "sprop" parameters may be incompatible with some signaling 
   protocol concepts, in which case the use of these parameters SHOULD 
   be avoided. 

7.1 Media Type Registration 

   The media subtype for the SVC codec is allocated from the IETF tree. 

   The receiver SHOULD ignore any unspecified parameter. 

      Informative note: Requiring that the receiver ignores unspecified 
      parameters allows for backward compatibility of future 
      extensions.  For example, if a future specification that is 
      backward compatible to this specification specifies some new 
      parameters, then a receiver according to this specification is 
      capable of receiving data per the new payload but ignoring those 
      parameters newly specified in the new payload specification.  
      This provision is also present in RFC 3984.  

   Media Type name:     video 

   Media subtype name:  H264-SVC 

   [Ed. (TS): Text on "H264" must go into different section, see 
   Colin's comments sent on 10 June 2008] 

   The media subtype "H264" MUST be used for RTP streams using RFC 
   3984, i.e., not using any of the new features introduced by this 
   specification compared to RFC 3984.  [Ed. (YkW): The new features 
   are to be listed herein.]   

   For RTP streams using any of the new features introduced by this 
   specification compared to RFC 3984, the media subtype "H264-SVC" 
   SHOULD be used, and the media subtype "H264" MAY be used.  Use of 
   the media subtype "H264" for RTP streams using the new features 
   allows for RFC 3984 receivers to negotiate and receive H.264/AVC or 
   SVC streams packetized according to this specification, but to 
   ignore media parameters and NAL unit types it does not recognize. 

   Required parameters: none 
 
 
Wenger, et al           Expires March 26, 2009                [Page 61] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   OPTIONAL parameters: 

   [Ed. (YkW): Check whether the current semantics of each of the 
   parameters from RFC 3984 apply accurately for both SST and MST. For 
   example, for packetization-mode, some additional constraints of the 
   value depending on the value of mst-mode should be added.] 

      profile-level-id: 
         A base16 [RFC3548] (hexadecimal) representation of the 
         following three bytes in the sequence parameter set NAL unit 
         specified in [H.264]: 1) profile_idc, 2) a byte herein 
         referred to as profile-iop, composed of the values of 
         constraint_set0_flag, constraint_set1_flag, 
         constraint_set2_flag, constraint_set3_flag, and 
         reserved_zero_4bits in bit-significance order, starting from 
         the most significant bit, and 3) level_idc.  Note that 
         reserved_zero_4bits is required to be equal to 0 in [H.264], 
         but other values for it may be specified in the future by ITU-
         T or ISO/IEC. 

         If the profile-level-id parameter is used to indicate 
         properties of a NAL unit stream, it indicates the profile and 
         level that a decoder has to support in order to comply with 
         [H.264] when it decodes the NAL unit stream.  The profile-iop 
         byte indicates whether the NAL unit stream also obeys all the 
         constraints as specified in subsection G.7.4.2.1.1 of [H.264].  
         Herein the NAL unit stream refers to the one consisting of all 
         NAL units conveyed in the current RTP session, and all NAL 
         units conveyed in other RTP sessions, if present, that the 
         current RTP session depends on.  The current RTP session MAY 
         depend on other RTP sessions when a scalable bitstream is 
         transported with more than one RTP session and the current 
         session is not an independent RTP session. 

         If the profile-level-id parameter is used for capability 
         exchange or session setup, it indicates the profile that the 
         codec supports and the highest level supported for the 
         signaled profile.  The profile-iop byte indicates whether the 
         codec has additional limitations whereby only the common 
         subset of the algorithmic features and limitations signaled 
         with the profile-iop byte is supported by the codec.  For 
         example, if a codec supports only the common subset of the 
         coding tools of the Baseline profile and the Main profile at 
         level 2.1 and below, the profile-level-id becomes 42E015, in 
         which 42 stands for the Baseline profile, E0 indicates that 
         only the common subset for all profiles is supported, and 15 
         indicates level 2.1. 
 
 
Wenger, et al           Expires March 26, 2009                [Page 62] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

            Informative note: Capability exchange and session setup 
            procedures should provide means to list the capabilities 
            for each supported codec profile separately.  For example, 
            the one-of-N codec selection procedure of the SDP 
            Offer/Answer model can be used (section 10.2 of [RFC4566]). 

         If no profile-level-id is present, the Baseline Profile 
         without additional constraints at Level 1 MUST be implied. 

      max-mbps, max-fs, max-cpb, max-dpb, and max-br: 
         The common property of these parameters is as specified in RFC 
         3984. 

      max-mbps: This parameter is as specified in RFC 3984. 

      max-fs: This parameter is as specified in RFC 3984. 

      max-cpb: The value of max-cpb is an integer indicating the 
         maximum coded picture buffer size in units of 1000 bits for 
         the VCL HRD parameters (see A.3.1 item i or G.10.2.2 item g of 
         [H.264]) and in units of 1200 bits for the NAL HRD parameters 
         (see A.3.1 item j or G.10.2.2 item h of [H.264]).  The max-cpb 
         parameter signals that the receiver has more memory than the 
         minimum amount of coded picture buffer memory required by the 
         signaled level conveyed in the value of the profile-level-id 
         parameter.  When max-cpb is signaled, the receiver MUST be 
         able to decode NAL unit streams that conform to the signaled 
         level, with the exception that the MaxCPB value in Table A-1 
         of [H.264] for the signaled level is replaced with the value 
         of max-cpb.  The value of max-cpb MUST be greater than or 
         equal to the value of MaxCPB for the level given in Table A-1 
         of [H.264].  Senders MAY use this knowledge to construct coded 
         video streams with greater variation of bit rate than can be 
         achieved with the MaxCPB value in Table A-1 of [H.264]. 

            Informative note: The coded picture buffer is used in the 
            Hypothetical Reference Decoder (HRD, Annex C) of [H.264].  
            The use of the HRD is recommended in SVC encoders to verify 
            that the produced bitstream conforms to the standard and to 
            control the output bit rate.  Thus, the coded picture 
            buffer is conceptually independent of any other potential 
            buffers in the receiver, including remultiplexing and de-
            jitter buffers.  The coded picture buffer need not be 
            implemented in decoders as specified in Annex C of [H.264]; 
            standard-compliant decoders can have any buffering 
            arrangements provided that they can decode standard-
            compliant bitstreams.  Thus, in practice, the input buffer 
 
 
Wenger, et al           Expires March 26, 2009                [Page 63] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

            for video decoder can be integrated with the remultiplexing 
            and de-jitter buffers of the receiver. 

      max-dpb: This parameter is as specified in RFC 3984. 

      max-br: The value of max-br is an integer indicating the maximum 
         video bit rate in units of 1000 bits per second for the VCL 
         HRD parameters (see A.3.1 item i or G.10.2.2 item g of 
         [H.264]) and in units of 1200 bits per second for the NAL HRD 
         parameters (see A.3.1 item j or G.10.2.2 item h of [H.264]). 

         The max-br parameter signals that the video decoder of the 
         receiver is capable of decoding video at a higher bit rate 
         than is required by the signaled level conveyed in the value 
         of the profile-level-id parameter. 

         When max-br is signaled, the video codec of the receiver MUST 
         be able to decode NAL unit streams that conform to the 
         signaled level, conveyed in the profile-level-id parameter, 
         with the following exceptions in the limits specified by the 
         level: 

         o The value of max-br replaces the MaxBR value of the 
            signaled level (in Table A-1 of [H.264]). 

         o When the max-cpb parameter is not present, the result of 
            the following formula replaces the value of MaxCPB in Table 
            A-1 of [H.264]: (MaxCPB of the signaled level) * max-br / 
            (MaxBR of the signaled level). 

         For example, if a receiver signals capability for Level 1.2 
         with max-br equal to 1550, this indicates a maximum video 
         bitrate of 1550 kbits/sec for VCL HRD parameters, a maximum 
         video bitrate of 1860 kbits/sec for NAL HRD parameters, and a 
         CPB size of 4036458 bits (1550000 / 384000 * 1000 * 1000). 

         The value of max-br MUST be greater than or equal to the value 
         MaxBR for the signaled level given in Table A-1 of [H.264]. 

         Senders MAY use this knowledge to send higher bitrate video as 
         allowed in the level definition of SVC, to achieve improved 
         video quality. 

            Informative note: This parameter was added primarily to 
            complement a similar codepoint in the ITU-T Recommendation 
            H.245, so as to facilitate signaling gateway designs.  No 
            assumption can be made from the value of this parameter 
 
 
Wenger, et al           Expires March 26, 2009                [Page 64] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

            that the network is capable of handling such bit rates at 
            any given time.  In particular, no conclusion can be drawn 
            that the signaled bit rate is possible under congestion 
            control constraints. 

      redundant-pic-cap: 
         This parameter is as specified in RFC 3984. 

      sprop-parameter-sets: 
         This parameter MAY be used to convey any sequence parameter 
         set, subset sequence parameter set and picture parameter set 
         NAL units (herein referred to as the initial parameter set NAL 
         units) that MUST be placed in the NAL unit stream to precede 
         any other NAL units in decoding order by the receiver.  The 
         parameter MUST NOT be used to indicate codec capability in any 
         capability exchange procedure.  The value of the parameter is 
         the base64 [RFC3548] representation of the initial parameter 
         set NAL units as specified in sections 7.3.2.1, 7.3.2.2 and 
         G.7.3.2.1 of [H.264].  The parameter sets are conveyed in 
         decoding order, and no framing of the parameter set NAL units 
         takes place.  A comma is used to separate any pair of 
         parameter sets in the list.  Note that the number of bytes in 
         a parameter set NAL unit is typically less than 10, but a 
         picture parameter set NAL unit can contain several hundreds of 
         bytes. 

            Informative note: When several payload types are offered in 
            the SDP Offer/Answer model, each with its own sprop-
            parameter-sets parameter, then the receiver cannot assume 
            that those parameter sets do not use conflicting storage 
            locations (i.e., identical values of parameter set 
            identifiers).  Therefore, a receiver should double-buffer 
            all sprop-parameter-sets and make them available to the 
            decoder instance that decodes a certain payload type. 

      parameter-add:  
         This parameter is as specified in RFC 3984. 

      packetization-mode:  
         This parameter is as specified in RFC 3984. 

      sprop-interleaving-depth:  
         This parameter is as specified in RFC 3984. 

      sprop-deint-buf-req: 
         This parameter is as specified in RFC 3984. 

 
 
Wenger, et al           Expires March 26, 2009                [Page 65] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

      deint-buf-cap: 
         This parameter is as specified in RFC 3984. 

      sprop-init-buf-time: 
         This parameter is as specified in RFC 3984. 

      sprop-max-don-diff: 
         This parameter is as specified in RFC 3984. 

      max-rcmd-nalu-size: 
         This parameter is as specified in RFC 3984. 

      mst-mode: 
         This parameter MAY be used to signal the properties of a NAL 
         unit stream or the capabilities of a receiver implementation.  
         If this parameter is present, multi-session transmission MUST 
         be used.  Otherwise (this parameter is not present), single-
         session transmission MUST be used.  When this parameter is 
         present, the following applies.  When the value of mst-mode is 
         equal to "NI-T", the NI-T mode MUST be used.  When the value 
         of mst-mode is equal to "NI-C", the NI-C mode MUST be used.  
         When the value of mst-mode is equal to "NI-TC", the NI-TC mode 
         MUST be used.  When the value of mst-mode is equal to "I-C", 
         the I-C mode MUST be used.  The value of mst-mode MUST have 
         one of the following tokens: "NI-T", "NI-C", "NI-TC", or "I-
         C". 

         All RTP sessions in an MST MUST have the same value of mst-
         mode. 

      sprop-mst-csdon-always-present: 
         This parameter MUST NOT be present when mst-mode is not 
         present or the value of mst-mode is equal to "NI-T" or "I-C".  
         This parameter signals the properties of the NAL unit stream 
         carried in the current RTP session and the RTP sessions the 
         current RTP session depends on.  When sprop-mst-csdon-always-
         present is present and the value is equal to 1, packetization-
         mode MUST be equal to 1, and all the RTP packets carrying the 
         NAL unit stream MUST be STAP-A packets containing a PACSI NAL 
         unit that further contains the DONC field. 

         When sprop-mst-csdon-always-present is present in the current 
         RTP session, it MUST be present also in all the RTP sessions 
         the current RTP session depends on and the value of sprop-mst-
         csdon-always-present is identical for the current RTP 
         sessionand all the RTP sessions the current RTP session 
         depends on. 
 
 
Wenger, et al           Expires March 26, 2009                [Page 66] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

      sprop-mst-remux-buf-size: 
         This parameter MUST NOT be present when mst-mode is not 
         present or the value of mst-mode is equal to "NI-T".  This 
         parameter MUST be present when mst-mode is present and the 
         value of mst-mode is equal to "NI-C", "NI-TC", or "I-C". 

         This parameter signals the properties of the NAL unit stream 
         carried in the current RTP session and the RTP sessions the 
         current RTP session depends on.  It MUST be set to a value one 
         less than the minimum remultiplexing buffer size (in NAL 
         units), so that it is guaranteed that receivers can 
         reconstruct NAL unit decoding order as specified in Subsection 
         6.2.2. 

         The value of sprop-mst-remux-buf-size MUST be an integer in 
         the range of 0 to 32767, inclusive. 

      sprop-remux-buf-req: 
         This parameter MUST NOT be present when mst-mode is not 
         present or the value of mst-mode is equal to "NI-T".  It MUST 
         be present when mst-mode is present and the value of mst-mode 
         is equal to "NI-C", "NI-TC", or "I-C". 

         sprop-remux-buf-req signals the required size of the 
         remultiplexing buffer for the NAL unit stream carried in the 
         current RTP session and the RTP sessions the current RTP 
         session depends on.  It is guaranteed that receivers can 
         recover the decoding order of the received NAL units from the 
         current RTP session and the RTP sessions the current RTP 
         session depends on as specified in section 6.2.2, when the 
         remultiplexing buffer size is of at least the value of sprop-
         remux-buf-req in terms of bytes. 

         The value of sprop-remux-buf-req MUST be an integer in the 
         range of 0 to 4294967295, inclusive. 

      remux-buf-cap: 
         This parameter MUST NOT be present when mst-mode is not 
         present or the value of mst-mode is equal to "NI-T".  This 
         parameter signals the capabilities of a receiver 
         implementation and indicates the amount of remultiplexing 
         buffer space in units of bytes that the receiver has available 
         for recovering the NAL unit decoding order as specified in 
         Section 6.2.2.  A receiver is able to handle any NAL unit 
         stream for which the value of the sprop-remux-buf-req 
         parameter is smaller than or equal to this parameter. 

 
 
Wenger, et al           Expires March 26, 2009                [Page 67] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

         If the parameter is not present, then a value of 0 MUST be 
         used for remux-buf-cap.  The value of remux-buf-cap MUST be an 
         integer in the range of 0 to 4294967295, inclusive. 

      sprop-remux-init-buf-time: 
         This parameter MAY be used to signal the properties of a NAL 
         unit stream carried in the current RTP session and the RTP 
         sessions the current RTP session depends on.  The parameter 
         MUST NOT be present if mst-mode is not present or the value of 
         mst-mode is equal to "NI-T". 

         The parameter signals the initial buffering time that a 
         receiver MUST wait before starting to recover the NAL unit 
         decoding order as specified in Section 6.2.2 of this memo. 

         The parameter is coded as a non-negative base10 integer 
         representation in clock ticks of a 90-kHz clock.  If the 
         parameter is not present, then no initial buffering time value 
         is defined.  Otherwise the value of sprop-remux-init-buf-time 
         MUST be an integer in the range of 0 to 4294967295, inclusive. 

      sprop-mst-max-don-diff: 
         This parameter MAY be used to signal the properties of a NAL 
         unit stream carried in the current RTP session and the RTP 
         sessions the current RTP session depends on.  It MUST NOT be 
         used to signal transmitter or receiver or codec capabilities.  
         The parameter MUST NOT be present if mst-mode is not present 
         or the value of mst-mode is equal to "NI-T".  sprop-mst-max-
         don-diff is an integer in the range of 0 to 32767, inclusive.  
         If sprop-mst-max-don-diff is not present, the value of the 
         parameter is unspecified.  sprop-mst-max-don-diff is 
         calculated same as sprop-max-don-diff as specified in RFC 
         3984, with decoding order number being replaced by cross-
         session decoding order number. 

      sprop-scalability-info: 
         This parameter MAY be used to convey the NAL unit containing 
         the scalability information SEI message as specified in Annex 
         G of [H.264].  This parameter MAY be used to signal the 
         contained Layers of an SVC bitstream.  The parameter MUST NOT 
         be used to indicate codec capability in any capability 
         exchange procedure.  The value of the parameter is the base64 
         representation of the NAL unit containing the scalability 
         information SEI message.  If present, the NAL unit MUST 
         contain only a scalability information SEI message. 


 
 
Wenger, et al           Expires March 26, 2009                [Page 68] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

         This parameter MAY be used in an offering or declarative SDP 
         message to indicate what Layers can be provided.  A receiver 
         MAY indicate its choice of one Layer using the optional media 
         type parameter scalable-layer-id. 

      sprop-layer-range: 
         This parameter MAY be used to signal two sets of the layer 
         identification values of the lowest and highest operation 
         points conveyed in the RTP session.  Each set is a base16 
         representation of a three-character value, with the first 
         character representing DID, the second character representing 
         QID, and the third character representing TID.  The two sets 
         are comma separated.  Let DIDl and DIDh be the lowest DID 
         value and the highest DID value, respectively, among all the 
         NAL units conveyed in the RTP session.  Let QIDl and TIDl be 
         the lowest QID value and the lowest TID value, respectively, 
         among all the NAL units that are conveyed in the RTP session 
         and that have DID equal to DIDl.  Let QIDh and TIDh be the 
         highest QID value and the highest TID value, respectively, 
         among all the NAL units that are conveyed in the RTP session 
         and that have DID equal to DIDh.  The first set indicates the 
         DID, QID and TID values of the lowest operation point, for 
         which the DID, QID and TID values are equal to DIDl, QIDl, and 
         TIDl, respectively.  The second set indicates the DID, QID and 
         TID values of the highest operation point, for which the DID, 
         QID and TID values are equal to DIDh, QIDh, and TIDh, 
         respectively. 

      scalable-layer-id: 
         This parameter MAY be used to signal a receiver's choice of 
         the offers or declared operation points or layers using sprop-
         scalability-info.  The value of scalable-layer-id is a base16 
         representation of the layer_id[ i ] syntax element in the 
         scalability information SEI message as specified in Annex G of 
         [H.264]. 

         [Ed. (TS): That is, a SDP capable receiver/middle-box must 
         (YK: Not must, but may, only when desired) decode the sprop-
         scalability-info syntax, which is not specified in this memo, 
         to select a scalable-layer-id.  This is currently not 
         addressed in the offer answer section!] 

      sprop-frame-size: 
         This parameter MAY be used to signal the pixel dimensions of 
         decoded frames of the lowest and the highest operation points 
         conveyed in the current RTP session.  The value is a base16 
         representation of the width and height of decoded frames of 
 
 
Wenger, et al           Expires March 26, 2009                [Page 69] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

         the lowest operation point, followed by the width and height 
         of decoded frames of the highest operation point, in pixels.  
         The four values of width or height are separated by three 
         commas. 

      sprop-bit-rate: 
         This parameter MAY be used to signal the bitrate values of the 
         lowest and the highest operation points conveyed in the 
         current RTP session.  The value is a base16 representation of 
         the bitrate values of the lowest and the highest operation 
         points, in bits/s, separated by a comma. 

      sprop-frame-rate: 
         This parameter MAY be used to signal the frame rate values of 
         the lowest and the highest operation points conveyed in the 
         current RTP session.  The value is a base16 representation of 
         the frame rate values of the lowest and the highest operation 
         points, in frames/s, multiplied by 1000.  The two frame rate 
         values are separated by a comma. 

      Encoding considerations: 
         This type is only defined for transfer via RTP (RFC 3550). 

      Security considerations: 
         See Section 8 of RFC XXXX. 

      Public specification: 
         Please refer to Section 14 of RFC XXXX. 

      Additional information: 
         None 

      File extensions:     none 

      Macintosh file type code: none 

      Object identifier or OID: none 

      Person & email address to contact for further information: 

      Intended usage:      COMMON 

      Author: 

      Change controller: 
         IETF Audio/Video Transport working group delegated from the 
         IESG. 
 
 
Wenger, et al           Expires March 26, 2009                [Page 70] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

7.2 SDP Parameters 

   [Ed. (YkW): For agreeing on a Layer or OP in unicast, an SDP can 
   contain multiple m lines with bit rate, frame rate and spatial 
   resolution parameters available, in addition to sprop-scalability-
   info.  The receive can select one of the m lines, or, for operation 
   points that are not included in the m lines, one of the "scalable 
   layers" specified by sprop-scalability-info using scalable-layer-id. 

   For layered multicast, then the grouping signaling in I-D.ietf-
   mmusic-decoding-dependency is needed. 

   The above would conveniently support also the normal ROI use cases 
   (with a few ROIs each indicated as a "scalable layer") but not the 
   interactive ROI use cases.  The quality layer using priority_id use 
   cases are not supported either.  That would need one more optional 
   media type parameter, to identify a quality layer.  The lightweight 
   transcoding use cases should be supported well by using (multiple) 
   normal AVC SDP offering messages.] 

7.2.1 Mapping of Payload Type Parameters to SDP 

   The media type video/H264-SVC string is mapped to fields in the 
   Session Description Protocol (SDP) as follows: 

   o  The media name in the "m=" line of SDP MUST be video. 

   o  The encoding name in the "a=rtpmap" line of SDP MUST be H264-SVC 
      (the media subtype). 

   o  The clock rate in the "a=rtpmap" line MUST be 90000. 

   o  The OPTIONAL parameters "profile-level-id", "max-mbps", "max-fs", 
      "max-cpb", "max-dpb", "max-br", "redundant-pic-cap", "sprop-
      parameter-sets", "parameter-add", "packetization-mode", "sprop-
      interleaving-depth", "deint-buf-cap", "sprop-deint-buf-req", 
      "sprop-init-buf-time", "sprop-max-don-diff", "max-rcmd-nalu-
      size", "mst-mode", "sprop-mst-csdon-always-present", "sprop-mst-
      remux-buf-size", "sprop-remux-buf-req", "remux-buf-cap", "sprop-
      remux-init-buf-time", "sprop-mst-max-don-diff", "sprop-layer-
      range", "sprop-scalability-info", "scalable-layer-id", "sprop-
      frame-size", "sprop-bit-rate", and "sprop-frame-rate", when 
      present, MUST be included in the "a=fmtp" line of SDP.  These 
      parameters are expressed as a media type string, in the form of a 
      semicolon separated list of parameter=value pairs. 


 
 
Wenger, et al           Expires March 26, 2009                [Page 71] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

7.2.2 Usage with the SDP Offer/Answer Model 

   When SVC is offered over RTP using SDP in an Offer/Answer model 
   [RFC3264] for negotiation for unicast usage, the following 
   limitations and rules apply: 

   o  The parameters identifying a media format configuration for SVC 
      are "profile-level-id", "packetization-mode", and, if required by 
      "packetization-mode", "sprop-deint-buf-req". [Ed. (AE): mst-mode 
      should be added?]  These three parameters MUST be used 
      symmetrically; i.e., the answerer MUST either maintain all 
      configuration parameters or remove the media format (payload 
      type) completely, if one or more of the parameter values are not 
      supported. 

         Informative note: The requirement for symmetric use applies 
         only for the above three parameters and not for the other 
         stream properties and capability parameters. 

      To simplify handling and matching of these configurations, the 
      same RTP payload type number used in the offer SHOULD also be 
      used in the answer, as specified in [RFC3264].  An answer MUST 
      NOT contain a payload type number used in the offer unless the 
      configuration ("profile-level-id", "packetization-mode", and, if 
      present, "sprop-deint-buf-req") is the same as in the offer. 

         Informative note: An offerer, when receiving the answer, has 
         to compare payload types not declared in the offer based on 
         media type (i.e., video/H264-SVC) and the above three 
         parameters with any payload types it has already declared, in 
         order to determine whether the configuration in question is 
         new or equivalent to a configuration already offered. 

      An answerer MAY select from the layers offered in the "sprop-
      scalability-information" parameter by including "scalable-layer-
      id" or "sprop-layer-range" in the answer. [Ed (YK): do we need to 
      additionally define behavior with snd/rcvonly parameter? Also, 
      add example.] 









 
 
Wenger, et al           Expires March 26, 2009                [Page 72] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   o  The parameters "sprop-parameter-sets", "sprop-deint-buf-req", 
      "sprop-interleaving-depth", "sprop-max-don-diff", "sprop-init-
      buf-time", "sprop-scalability-information", "sprop-layer-range" 
      describe the properties of the NAL unit stream that the offerer 
      or answerer is sending for this media format configuration.  This 
      differs from the normal usage of the Offer/Answer parameters: 
      normally such parameters declare the properties of the stream 
      that the offerer or the answerer is able to receive.  When 
      dealing with SVC, the offerer assumes that the answerer will be 
      able to receive media encoded using the configuration being 
      offered. 

         Informative note: The above parameters apply for any stream 
         sent by the declaring entity with the same configuration; 
         i.e., they are dependent on their source.  Rather then being 
         bound to the payload type, the values may have to be applied 
         to another payload type when being sent, as they apply for the 
         configuration. 

   o  The capability parameters ("max-mbps", "max-fs", "max-cpb",  
      "max-dpb", "max-br", ,"redundant-pic-cap", "max-rcmd-nalu-size") 
      MAY be used to declare further capabilities.  Their 
      interpretation depends on the direction attribute.  When the 
      direction attribute is sendonly, then the parameters describe the 
      limits of the RTP packets and the NAL unit stream that the sender 
      is capable of producing.  When the direction attribute is 
      sendrecv or recvonly, then the parameters describe the 
      limitations of what the receiver accepts. 

   o  As specified above, an offerer has to include the size of the 
      deinterleaving buffer in the offer for an interleaved SVC stream.  
      To enable the offerer and answerer to inform each other about 
      their capabilities for deinterleaving buffering, both parties are 
      RECOMMENDED to include "deint-buf-cap".  This information MAY be 
      used when the value for "sprop-deint-buf-req" is selected in a 
      second round of offer and answer.  For interleaved streams, it is 
      also RECOMMENDED to consider offering multiple payload types with 
      different buffering requirements when the capabilities of the 
      receiver are unknown. 








 
 
Wenger, et al           Expires March 26, 2009                [Page 73] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   o  The "sprop-parameter-sets" parameter is used as described above.  
      In addition, an answerer MUST maintain all parameter sets 
      received in the offer in its answer.  Depending on the value of 
      the "parameter-add" parameter, different rules apply: If 
      "parameter-add" is false (0), the answer MUST NOT add any 
      additional parameter sets.  If "parameter-add" is true (1), the 
      answerer, in its answer, MAY add additional parameter sets to the 
      "sprop-parameter-sets" parameter.  The answerer MUST also, 
      independent of the value of "parameter-add", accept to receive a 
      video stream using the sprop-parameter-sets it declared in the 
      answer. 

         Informative note: care must be taken when parameter sets are 
         added not to cause overwriting of already transmitted 
         parameter sets by using conflicting parameter set identifiers. 

   For streams being delivered over multicast, the following rules 
   apply in addition: 

   o  The stream properties parameters ("sprop-parameter-sets", "sprop- 
      deint-buf-req", "sprop-interleaving-depth", "sprop-max-don-diff", 
      "sprop-init-buf-time", "sprop-scalability-information", and 
      "sprop-layer-range") MUST NOT be changed by the answerer.  Thus, 
      a payload type can either be accepted unaltered or removed. 

   o  The receiver capability parameters "max-mbps", "max-fs", "max-
      cpb", "max-dpb", "max-br", and "max-rcmd-nalu-size" MUST be 
      supported by the answerer for all streams declared as sendrecv or 
      recvonly; otherwise, one of the following actions MUST be 
      performed: the media format is removed, or the session rejected. 

   o  The receiver capability parameter redundant-pic-cap SHOULD be 
      supported by the answerer for all streams declared as sendrecv or 
      recvonly as follows:  The answerer SHOULD NOT include redundant 
      coded pictures in the transmitted stream if the offerer indicated 
      redundant-pic-cap equal to 0.  Otherwise (when redundant_pic_cap 
      is equal to 1), it is beyond the scope of this memo to recommend 
      how the answerer should use redundant coded pictures. 

   Below are the complete lists of how the different parameters shall 
   be interpreted in the different combinations of offer or answer and 
   direction attribute. 

   o  In offers and answers for which "a=sendrecv" or no direction 
      attribute is used, or in offers and answers for which 
      "a=recvonly" is used, the following interpretation of the 
      parameters MUST be used. 
 
 
Wenger, et al           Expires March 26, 2009                [Page 74] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

      Declaring actual configuration or properties for receiving: 

         - profile-level-id 
         - packetization-mode 

      Declaring actual properties of the stream to be sent (applicable 
      only when "a=sendrecv" or no direction attribute is used): 

         - sprop-deint-buf-req 
         - sprop-interleaving-depth 
         - sprop-parameter-sets 
         - sprop-max-don-diff 
         - sprop-init-buf-time 
         - sprop-scalability-information 
         - sprop-layer-range 
         - scalable-layer-id 

      Declaring receiver implementation capabilities: 

         - max-mbps 
         - max-fs 
         - max-cpb 
         - max-dpb 
         - max-br 
         - redundant-pic-cap 
         - deint-buf-cap 
         - max-rcmd-nalu-size 

      Declaring how Offer/Answer negotiation shall be performed: 

         - parameter-add 

   o  In an offer or answer for which the direction attribute 
      "a=sendonly" is included for the media stream, the following 
      interpretation of the parameters MUST be used: 

      Declaring actual configuration and properties of stream proposed 
      to be sent: 

         - profile-level-id 
         - packetization-mode 
         - sprop-deint-buf-req 
         - sprop-max-don-diff 
         - sprop-init-buf-time 
         - sprop-parameter-sets 
         - sprop-interleaving-depth 
         - sprop-scalability-information 
 
 
Wenger, et al           Expires March 26, 2009                [Page 75] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

         - sprop-layer-range 
         - sprop-spatial-resolution 

      Declaring how Offer/Answer negotiation shall be performed: 

         - parameter-add 

   Furthermore, the following considerations are necessary: 

   o  Parameters used for declaring receiver capabilities are in 
      general downgradable; i.e., they express the upper limit for a 
      sender's possible behavior.  Thus a sender MAY select to set its 
      encoder using only lower/lesser or equal values of these 
      parameters. "sprop-parameter-sets" MUST NOT be used in a sender's 
      declaration of its capabilities, as the limits of the values that 
      are carried inside the parameter sets are implicit with the 
      profile and level used. 

   o  Parameters declaring a configuration point are not downgradable, 
      with the exception of the level part of the "profile-level-id" 
      parameter.  This expresses values a receiver expects to be used 
      and must be used verbatim on the sender side. 

   o  When a sender's capabilities are declared, and non-downgradable 
      parameters are used in this declaration, then these parameters 
      express a configuration that is acceptable.  In order to achieve 
      high interoperability levels, it is often advisable to offer 
      multiple alternative configurations; e.g., for the packetization 
      mode.  It is impossible to offer multiple configurations in a 
      single payload type.  Thus, when multiple configuration offers 
      are made, each offer requires its own RTP payload type associated 
      with the offer. 

   o  A receiver SHOULD understand all MIME parameters, even if it only 
      supports a subset of the payload format's functionality.  This 
      ensures that a receiver is capable of understanding when an offer 
      to receive media can be downgraded to what is supported by 
      receiver of the offer. 

   o  An answerer MAY extend the offer with additional media format 
      configurations.  However, to enable their usage, in most cases a 
      second offer is required from the offerer to provide the stream 
      properties parameters that the media sender will use.  This also 
      has the effect that the offerer has to be able to receive this 
      media format configuration, not only to send it. 


 
 
Wenger, et al           Expires March 26, 2009                [Page 76] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   o  If an offerer wishes to have non-symmetric capabilities between 
      sending and receiving, the offerer has to offer different RTP 
      sessions; i.e., different media lines declared as "recvonly" and 
      "sendonly", respectively.  This may have further implications on 
      the system. 

7.2.3 Usage with Multi-Source Transmission 

   If MST is used, the rules on signaling media decoding dependency in 
   SDP as defined in [I-D.ietf-mmusic-decoding-dependency] apply. 

7.2.4 Usage in Declarative Session Descriptions 

   When SVC over RTP is offered with SDP in a declarative style, as in 
   RTSP [RFC2326] or SAP [RFC2974], the following considerations are 
   necessary. 

   o  All parameters capable of indicating the properties of both a NAL 
      unit stream and a receiver are used to indicate the properties of 
      a NAL unit stream.  For example, in this case, the parameter 
      "profile-level-id" declares the values used by the stream, 
      instead of the capabilities of the sender.  This results in that 
      the following interpretation of the parameters MUST be used: 

      Declaring actual configuration or properties: 

         - profile-level-id 
         - sprop-parameter-sets 
         - packetization-mode 
         - sprop-interleaving-depth 
         - sprop-deint-buf-req 
         - sprop-max-don-diff 
         - sprop-init-buf-time 
         - sprop-layer-range 
         - sprop-spatial-resolution 
         - sprop-scalability-info 

      Not usable: 

         - max-mbps 
         - max-fs 
         - max-cpb 
         - max-dpb 
         - max-br 
         - redundant-pic-cap 
         - max-rcmd-nalu-size 
         - parameter-add 
 
 
Wenger, et al           Expires March 26, 2009                [Page 77] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

         - deint-buf-cap 
         - scalable_layer_id 

   o  A receiver of the SDP is required to support all parameters and 
      values of the parameters provided; otherwise, the receiver MUST 
      reject (RTSP) or not participate in (SAP) the session.  It falls 
      on the creator of the session to use values that are expected to 
      be supported by the receiving application. 

7.3 Examples 

7.3.1 Example for Offering A Single SVC Session 

      Offerer -> Answerer SDP message: 

      v=0 
      o=jdoe 2890844526 2890842807 IN IP4 192.0.2.12 
      s=SVC SDP example  
      i=SVC Scalable Video Coding session 
      t=2873397496 2873404696 
      m=video 20000 RTP/AVP 96 97 98 
      a=rtpmap:96 H264/90000 
      a=fmtp:96 profile-level-id=4d400a; packetization-mode=1; 
      sprop-parameter-sets=Z01ACprLFicg,aP4Eag==; 
      a=rtpmap:97 H264-SVC/90000 
      a=fmtp:97 profile-level-id=53000c; packetization-mode=1; 
      sprop-parameter-sets=Z01ACprLFicg,Z1MADEsA1NZYWCWQ,aP4Eag==,aEvgR
      qA=,aGvgRiA=; 
      a=rtpmap:98 H264-SVC/90000 
      a=fmtp:98 profile-level-id=53000c; packetization-mode=2; 
      init-buf-time=156320; 
      sprop-parameter-sets=Z01ACprLFicg,Z1MADEsA1NZYWCWQ,aP4Eag==,aEvgR
      qA=,aGvgRiA=; 

7.3.2 Example for Offering Session Multiplexing 

      Offerer -> Answerer SDP message: 

      v=0 
      o=jdoe 2890844526 2890842807 IN IP4 192.0.2.12 
      s=SVC Scalable Video Coding session 
      i=SDP is an Offer for a session offered by a transcoding entity 
      t=2873397496 2873404696 
      a=group:DDP 1 2 3 
      m=video 20000 RTP/AVP 96 97 98 
      a=rtpmap:96 H264/90000 
      a=fmtp:96 profile-level-id=4d400a; packetization-mode=0;  
 
 
Wenger, et al           Expires March 26, 2009                [Page 78] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

      mst-mode=NI-T; sprop-parameter-sets=Z01ACprLFicg,aP4Eag==; 
      a=rtpmap:97 H264/90000 
      a=fmtp:97 profile-level-id=53000c; packetization-mode=1;  
      mst-mode=NI-TC; sprop-parameter-sets=Z01ACprLFicg, 
      Z1MADEsA1NZYWCWQ,aP4Eag==,aEvgRqA=,aGvgRiA=; 
      a=rtpmap:98 H264/90000 
      a=fmtp:98 profile-level-id=53000c; packetization-mode=2;  
      mst-mode=I-C; init-buf-time=156320; 
      sprop-parameter-sets=Z01ACprLFicg,Z1MADEsA1NZYWCWQ,aP4Eag==,aEvgR
      qA=,aGvgRiA=; 
      a=mid:1 
      m=video 20002 RTP/AVP 99 100 
      a=rtpmap:99 H264-SVC/90000 
      a=fmtp:99 profile-level-id=53000c; packetization-mode=1;  
      mst-mode=NI-TC; sprop-parameter-sets=Z01ACprLFicg, 
      Z1MADEsA1NZYWCWQ,aP4Eag==,aEvgRqA=,aGvgRiA=; 
      a=rtpmap:100 H264-SVC/90000 
      a=fmtp:100 profile-level-id=53000c; packetization-mode=2; 
      mst-mode=I-C; sprop-parameter-sets=Z01ACprLFicg,Z1MADEsA1NZYWCWQ, 
      aP4Eag==,aEvgRqA=,aGvgRiA=; 
      a=mid:2 
      a=depend:99 lay 1:96,97; 100 lay 1:98 
      m=video 20004 RTP/AVP 101 
      a=rtpmap:101 H264-SVC/90000 
      a=fmtp:101 profile-level-id=53000c; packetization-mode=1;  
      mst-mode=NI-T; sprop-parameter-sets=Z01ACprLFicg, 
      Z1MADEsA1NZYWCWQ,aP4Eag==,aEvgRqA=,aGvgRiA=; 
      a=mid:3 
      a=depend:101 lay 1:96,97 2:99 

7.4 Parameter Set Considerations 

   Please see Section 8.4 of [RFC3984]. 

8. Security Considerations 

   Section 9 of [RFC3984] applies.  Additionally, the following 
   applies. 

   Decoders MUST exercise caution with respect to the handling of 
   reserved NAL unit types and reserved SEI messages, particularly if 
   they contain active elements, and MUST restrict their domain of 
   applicability to the presentation containing the stream.  The safest 
   way is to simply discard these NAL units and SEI messages. 



 
 
Wenger, et al           Expires March 26, 2009                [Page 79] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   When integrity protection is applied, care MUST be taken that the 
   stream being transported may be scalable; hence a receiver may be 
   able to access only part of the entire stream. 

      Informative note: Other security aspects, including 
      confidentiality, authentication, and denial-of-service threat, 
      for SVC are similar as H.264/AVC, as discussed in Section 9 of 
      [RFC3984]. 

9. Congestion Control 

   Within any given RTP session carrying payload according to this 
   specification, the provisions of section 12 of [RFC3984] apply.  
   Reducing the session bandwidth is possible by one or more of the 
   following means, listed in an order that, in most cases, will assure 
   the least negative impact to the user experience: 

   a) within the highest Layer identified by the DID field, utilize the 
     TID and/or QID fields in the NAL unit header to drop NAL units 
     with lower importance for the decoding process or human 
     perception. 

   b) drop all NAL units belonging to the highest enhancement Layer as 
     identified by the highest DID value. 

   c) dropping NAL units according to their importance for the decoding 
     process, as indicated by the fields in the NAL unit header of the 
     NAL units or in the prefix NAL units. 

   d) dropping NAL units or entire packets not according to the 
     aforementioned rules (media-unaware stream thinning).  This 
     results in the reception of a non-compliant bitstream and, most 
     likely, in very annoying artifacts. 

      Informative note: The discussion above is centered on NAL units 
      and not on packets, primarily because that is the level where 
      senders can meaningfully manipulate the scalable bitstream.  The 
      mapping of NAL units to RTP packets is fairly flexible when using 
      aggregation packets.  Depending on the nature of the congestion 
      control algorithm, the "dimension" of congestion measurement 
      (packet count or bitrate) and reaction to it (reducing packet 
      count or bitrate or both) can be adjusted accordingly. 

   All aforementioned means are available to the RTP sender, regardless 
   whether that sender is located in the sending endpoint or in a mixer 
   based MANE. 

 
 
Wenger, et al           Expires March 26, 2009                [Page 80] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   When a translator-based MANE is employed, then the MANE MAY 
   manipulate the session only on the MANE's outgoing path, so that the 
   sensed end-to-end congestion falls within the permissible envelope.  
   As all translators, in this case the MANE needs to rewrite RTCP RRs 
   to reflect the manipulations it has performed on the session. 

      Informative note: Applications MAY also implement, in addition or 
      separately, other congestion control mechanisms, e.g., as 
      described in [RFC3450] and [Yan]. 

10. IANA Consideration 

   [Ed. (YkW): A new media type should be registered from IANA.] 

11. Informative Appendix: Application Examples 

11.1 Introduction 

   Scalable video coding is a concept that has been around since at 
   least MPEG-2 [MPEG2], which goes back as early as 1993.  
   Nevertheless, it has never gained wide acceptance; perhaps partly 
   because applications didn't materialize in the form envisioned 
   during standardization. 

   ISO/IEC MPEG and ITU-T VCEG, respectively, performed a requirement 
   analysis for the SVC project.  Dozens of scenarios have been 
   studied.  While some of the scenarios appear not to follow the most 
   basic design principles of the Internet, e.g., as discussed in 
   section 11.6 -- and are therefore not appropriate for IETF 
   standardization -- others are clearly in the scope of IETF work.  Of 
   these, this draft chooses the following subset for immediate 
   consideration.  The MPEG and VCEG requirement documents are 
   available in [JVT-N026] and [JVT-N027], respectively. 

   With these remarks, we now introduce three main application 
   scenarios that we consider relevant, and that are implementable with 
   this specification. 

11.2 Layered Multicast 

   This well-understood form of the use of layered coding [McCanne] 
   implies that all layers are individually conveyed in their own RTP 
   packet streams, each carried in its own RTP session using the IP 
   (multicast) address and port number as the single demultiplexing 
   point.  Receivers "tune" into the layers by subscribing to the IP 
   multicast, normally by using IGMP [IGMP].  Depending on the 
   application scenario, it is also possible to convey a number of 
 
 
Wenger, et al           Expires March 26, 2009                [Page 81] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   layers in one RTP session, when finer operation points within the 
   subset of layers are not needed. 

   Layered multicast has the great advantage of simplicity and easy 
   implementation.  However, it has also the great disadvantage of 
   utilizing many different transport addresses.  While we consider 
   this not to be a major problem for a professionally maintained 
   content server, receiving client endpoints need to open many ports 
   to IP multicast addresses in their firewalls.  This is a practical 
   problem from a firewall and network address translation (NAT) 
   viewpoint.  Furthermore, even today IP multicast is not as widely 
   deployed as many wish. 

   We consider layered multicast an important application scenario for 
   the following reasons.  First, it is well understood and the 
   implementation constraints are well known.  Second, there may well 
   be large scale IP networks outside the immediate Internet context 
   that may wish to employ layered multicast in the future.  One 
   possible example could be a combination of content creation and 
   core-network distribution for the various mobile TV services, e.g., 
   those being developed by 3GPP (MBMS) [MBMS] and DVB (DVB-H) [DVB-H]. 

11.3 Streaming  

   In this scenario, a streaming server has a repository of stored SVC 
   coded layers for a given content.  At the time of streaming, and 
   according to the capabilities, connectivity, and congestion 
   situation of the client(s), the streaming server generates and 
   serves a scalable stream.  Both unicast and multicast serving is 
   possible.  At the same time, the streaming server may use the same 
   repository of stored layers to compose different streams (with a 
   different set of layers) intended for other audiences. 

   As every endpoint receives only a single SVC RTP session, the number 
   of firewall pinholes can be optimized to one. 

   The main difference between this scenario and straightforward 
   simulcasting lies in the architecture and the requirements of the 
   streaming server, and is therefore out of the scope of IETF 
   standardization.  However, compelling arguments can be made why such 
   a streaming server design makes sense.  One possible argument is 
   related to storage space and channel bandwidth.  Another is 
   bandwidth adaptability without transcoding -- a considerable 
   advantage in a congestion controlled network.  When the streaming 
   server learns about congestion, it can reduce sthe ending bit rate 
   by choosing fewer layers when composing the layered stream; see 
   section 9.  SVC is designed to gracefully support both bandwidth 
 
 
Wenger, et al           Expires March 26, 2009                [Page 82] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   ramp-down and bandwidth ramp-up with a considerable dynamic range.  
   This payload format is designed to allow for bandwidth flexibility 
   in the mentioned sense.  While, in theory, a transcoding step could 
   achieve a similar dynamic range, the computational demands are 
   impractically high and video quality is typically lowered -- 
   therefore, few (if any) streaming servers implement full 
   transcoding. 

11.4 Videoconferencing (Unicast to MANE, Unicast to Endpoints) 

   [Ed. (AE): TBD] 

11.5 Mobile TV (Multicast to MANE, Unicast to Endpoint) 

   This scenario is a bit more complex, and designed to optimize the 
   network traffic in a core network, while still requiring only a 
   single pinhole in the endpoint's firewall.  One of its key 
   applications is the mobile TV market. 

   Consider a large private IP network, e.g., the core network of 3GPP.  
   Streaming servers within this core network can be assumed to be 
   professionally maintained.  We assume that these servers can have 
   many ports open to the network and that layered multicast is a real 
   option.  Therefore, we assume that the streaming server multicasts 
   SVC scalable layers, instead of simulcasting different 
   representations of the same content at different bit rates. 

   Also consider many endpoints of different classes.  Some of these 
   endpoints may lack the processing power or the display size to 
   meaningfully decode all layers; others may have these capabilities.  
   Users of some endpoints may wish not to pay for high quality and are 
   happy with a base service, which may be cheaper or even free.  Other 
   users are willing to pay for high quality.  Finally, some connected 
   users may have a bandwidth problem in that they can't receive the 
   bandwidth they would want to receive -- be it through congestion, 
   connectivity, change of service quality, or for whatever other 
   reasons.  However, all these users have in common that they don't 
   want to be exposed too much, and therefore the number of firewall 
   pinholes needs to be small. 

   This situation can be handled best by introducing middleboxes close 
   to the edge of the core network, which receive the layered multicast 
   streams and compose the single SVC scalable bit stream according to 
   the needs of the endpoint connected.  These middleboxes are called 
   MANEs throughout this specification.  In practice, we envision the 
   MANE to be part of (or at least physically and topologically close 
   to) the base station of a mobile network, where all the signaling 
 
 
Wenger, et al           Expires March 26, 2009                [Page 83] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   and media traffic necessarily are multiplexed on the same physical 
   link.  This is why we do not worry too much about decomposition 
   aspects of the MANE as such. 

   MANEs necessarily need to be fairly complex devices.  They certainly 
   need to understand the signaling, so, for example, to associate the 
   PT octet in the RTP header with the SVC payload type.   

   A MANE may aggregate multiple RTP streams, possibly from multiple 
   RTP sessions, thus to reduce the number of firewall pinholes 
   required at the endpoints.  This type of MANEs is conceptually easy 
   to implement and can offer powerful features, primarily because it 
   necessarily can "see" the payload (including the RTP payload 
   headers), utilize the wealth of layering information available 
   therein, and manipulate it. 

   While such an MANE operation in its most trivial form (combining 
   multiple RTP packet streams into a single one) can be implemented 
   comparatively simply -- reordering the incoming packets according to 
   the DON and sending them in the appropriate order -- more complex 
   forms can also be envisioned.  For example, a MANE can be optimizing 
   the outgoing RTP stream to the MTU size of the outgoing path by 
   utilizing the aggregation and fragmentation mechanisms of this memo. 

   A MANE can also perform stream thinning, in order to adhere to 
   congestion control principles as discussed in Section 9.  While the 
   implementation of the forward (media) channel of such a MANE appears 
   to be comparatively simple, the need to rewrite RTCP RRs makes even 
   such a MANE a complex device. 

   While the implementation complexity of either case of a MANE, as 
   discussed above, is fairly high, the computational demands are 
   comparatively low.  In particular, SVC and/or this specification 
   contain means to easily generate the correct inter-layer decoding 
   order of NAL units.  No serious bit-oriented processing is required 
   and no significant state information (beyond that of the signaling 
   and perhaps the SVC sequence parameter sets) need to be kept.  

11.6 SSRC Multiplexing 

   The authors have considered the possibility of introducing SSRC 
   multiplexing, i.e., allowing sending multiple RTP packet streams 
   containing layers in the same RTP session, differentiated by SSRC 
   values.  The intention was to minimize the number of firewall 
   pinholes in an endpoint to one, by using MANEs to aggregate multiple 
   outgoing sessions stemming from a server into a single session (with 

 
 
Wenger, et al           Expires March 26, 2009                [Page 84] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   SSRC-multiplexed packet streams).  It was hoped that this would be 
   feasible even with encrypted packets in an SRTP context. 

   While an implementation along these lines indeed appears to be 
   feasible for the forward media path, the RTCP RR rewrite cannot be 
   implemented in the way necessary for this scheme to work.  This 
   relates to the need to authenticate the RTCP RRs as per SRTP 
   [RFC3711].  While the RTCP RR itself does not need to be rewritten 
   by the scheme envisioned, its transport addresses need to be 
   manipulated.  This, in turn, is incompatible with the mandatory 
   authentication of RTCP RRs.  As a result, there would be a 
   requirement that a MANE needs to be in the RTCP security context of 
   the sessions, which was not envisioned in the use case at hand.  
   Therefore this memo does provide support for SSRC multiplexing.  

12. References 

12.1 Normative References 

   [H.264]   ITU-T Recommendation H.264, "Advanced video coding for                                                  rd                  generic audiovisual services", 3  Edition, November 2007. 

   [I-D.ietf-mmusic-decoding-dependency]  Schierl, T., and Wenger, S., 
             "Signaling media decoding dependency in Session 
             Description Protocol (SDP)", draft-ietf-mmusic-decoding-
             dependency-02 (work in progress), May 2008. 

   [MPEG4-10]  ISO/IEC International Standard 14496-10:2005. 

   [RFC2119] Bradner, S., "Key words for use in RFCs to Indicate 
             Requirement Levels", BCP 14, RFC 2119, March 1997. 

   [RFC3264] Rosenberg, J. and H. Schulzrinne, "An Offer/Answer Model 
             With Session Description Protocol (SDP)", RFC 3264, June 
             2002. 

   [RFC3548] Josefsson, S., "The Base16, Base32, and Base64 Data 
             Encodings", RFC 3548, July 2003.  

   [RFC3550] Schulzrinne, H., Casner, S., Frederick, R., and Jacobson, 
             V., "RTP: A Transport Protocol for Real-Time 
             Applications", STD 64, RFC 3550, July 2003. 

   [RFC3984] Wenger, S., Hannuksela, M., Stockhammer, T., Westerlund, 
             M., and Singer, D., "RTP Payload Format for H.264 Video", 
             RFC 3984, February 2005. [Ed. (YkW): Update this to 
             RFC3984bis.] 
 
 
Wenger, et al           Expires March 26, 2009                [Page 85] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   [RFC4566] Handley, M., Jacobson, V., and Perkins, C., "SDP: Session 
             Description Protocol", RFC 4566, July 2006. 

12.2 Informative References 

   [DVB-H]   DVB - Digital Video Broadcasting (DVB); DVB-H 
             Implementation Guidelines, ETSI TR 102 377, 2005. 

   [H.241]   ITU-T Rec. H.241, "Extended video procedures and control 
             signals for H.300-series terminals", May 2006. 

   [IGMP]    Cain, B., Deering S., Kovenlas, I., Fenner, B., and 
             Thyagarajan, A., "Internet Group Management Protocol, 
             Version 3", RFC 3376, October 2002. 

   [JVT-N026]  Ohm J.-R., Koenen, R., and Chiariglione, L. (ed.), "SVC 
             requirements specified by MPEG (ISO/IEC JTC1 SC29 WG11)", 
             JVT-N026, available from http://ftp3.itu.ch/av-arch/jvt-
             site/2005_01_HongKongGeneva/JVT-N026.doc, Hong Kong, 
             China, January 2005. 

   [JVT-N027]  Sullivan, G., and Wiegand, T. (ed.), "SVC requirements 
             specified by VCEG (ITU-T SG16 Q.6)", JVT-N027, available 
             from http://ftp3.itu.ch/av-arch/jvt-
             site/2005_01_HongKongGeneva/JVT-N027.doc, Hong Kong, 
             China, January 2005. 

   [Lennox]    Lennox, J., Schierl, T., and Ganesan, S, "Real-Time 
             Transport Protocol (RTP) Timestamps for Layered 
             Encodings", draft-lennox-avt-rtp-layered-encoding-
             timestamps-00 (work in progress), June 2,2008. 

   [McCanne] McCanne, S., Jacobson, V., and Vetterli, M., "Receiver-
             driven layered multicast", in Proc. of ACM SIGCOMM'96, 
             pages 117--130, Stanford, CA, August 1996. 

   [MBMS]    3GPP - Technical Specification Group Services and System 
             Aspects; Multimedia Broadcast/Multicast Service (MBMS); 
             Protocols and codecs (Release 6), December 2005. 

   [MPEG2]   ISO/IEC International Standard 13818-2:1993. 

   [RFC2326] Schulzrinne, H., Rao, A., and R. Lanphier, "Real Time 
             Streaming Protocol (RTSP)", RFC 2326, April 1998. 

   [RFC2974] Handley, M., Perkins, C., and E. Whelan, "Session 
             Announcement Protocol", RFC 2974, October 2000. 
 
 
Wenger, et al           Expires March 26, 2009                [Page 86] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   [RFC3450] Luby, M., Gemmell, J., Vicisano, L., Rizzo, L., and 
             Crowcroft, J., "Asynchronous layered coding (ALC) protocol 
             instantiation", RFC 3450, December 2002. 

   [RFC3711] Baugher, M., McGrew, D, Naslund, M., Carrara, E., and 
             Norrman, K., "The secure real-time transport protocol 
             (SRTP)", RFC 3711, March 2004. 

   [Yan]     Yan, J., Katrinis, K., May, M., and Plattner, R., "Media-
             And TCP-friendly congestion control for scalable video 
             streams", in IEEE Trans. Multimedia, pages 196--206, April 
             2006. 

13. Authors' Addresses 

   Stephan Wenger 
   Nokia 
   955 Page Mill Road 
   Palo Alto, CA 94304 
   USA 
       
   Phone: +1-650-862-7368 
   EMail: stewe@stewe.org 
    
   Ye-Kui Wang 
   Nokia Research Center 
   P.O. Box 100 
   33721 Tampere 
   Finland 
       
   Phone: +358-50-466-7004 
   EMail: ye-kui.wang@nokia.com 
    
   Thomas Schierl 
   Fraunhofer HHI 
   Einsteinufer 37 
   D-10587 Berlin 
   Germany 
       
   Phone: +49-30-31002-227 
   Email: schierl@hhi.fhg.de 
    
   Alex Eleftheriadis 
 
 
Wenger, et al           Expires March 26, 2009                [Page 87] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

   Vidyo, Inc. 
   433 Hackensack Ave. 
   Hackensack, NJ 07601 
   USA 
       
   Phone: +1-201-467-5135 
   Email: alex@vidyo.com 
    

Intellectual Property Statement 

   The IETF takes no position regarding the validity or scope of any 
   Intellectual Property Rights or other rights that might be claimed 
   to pertain to the implementation or use of the technology described 
   in this document or the extent to which any license under such 
   rights might or might not be available; nor does it represent that 
   it has made any independent effort to identify any such rights.  
   Information on the procedures with respect to rights in RFC 
   documents can be found in BCP 78 and BCP 79. 

   Copies of IPR disclosures made to the IETF Secretariat and any 
   assurances of licenses to be made available, or the result of an 
   attempt made to obtain a general license or permission for the use 
   of such proprietary rights by implementers or users of this 
   specification can be obtained from the IETF on-line IPR repository 
   at http://www.ietf.org/ipr. 

   The IETF invites any interested party to bring to its attention any 
   copyrights, patents or patent applications, or other proprietary 
   rights that may cover technology that may be required to implement 
   this standard.  Please address the information to the IETF at 
   ietf-ipr@ietf.org. 

Disclaimer of Validity 

   This document and the information contained herein are provided on 
   an "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE 
   REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE 
   IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL 
   WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY 
   WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE 
   ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS 
   FOR A PARTICULAR PURPOSE. 



 
 
Wenger, et al           Expires March 26, 2009                [Page 88] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

Copyright Statement 

   Copyright (C) The IETF Trust (2008). 

   This document is subject to the rights, licenses and restrictions 
   contained in BCP 78, and except as set forth therein, the authors 
   retain all their rights. 

Acknowledgement 

   Funding for the RFC Editor function is currently provided by the 
   Internet Society.  Further, the author Thomas Schierl of Fraunhofer 
   HHI is sponsored by the European Commission under the contract 
   number FP7-ICT-214063, project SEA.  The authors want to thank 
   Jonathan Lennox for his valuable comments and input to the draft. 
   [Ed. (YkW): Thanks to many other contributors and reviewers TBD.] 

14. Open Issues  

   1) Regarding signaling: 
     A) Can mst-mode be used to signal receiver capabilities?  
     B) Is it possible to use offer/answer in MST? Is it possible to 
     use MST for unicast? If no, the MST related new parameters do not 
     need to be mentioned in the offer/answer section. For examples, 
     the decoder configuration defined for offer/answer then does not 
     include mst-mode, and the second SDP example for MST needs to be 
     removed from the offer/answer section but as an example of the 
     declarative usage of the parameters.  
     C) What offer/answer examples are needed? Current we only have two 
     offer examples with no answer, one for SST and one for MST.  
     D) It seemed that the SDP exchange process in unicast streaming 
     applications is not called offer/answer. Should we include any 
     example for such SDP exchange (e.g. the use of sprop-scalability-
     info and scalable-layer-id)? Is there a good name (like 
     offer/answer for conversational applications) for this? 
     E) Signaling support for on-the-fly change of codec modes (YK: 
     what does codec mode mean?).  This must be done in syn with 
     3984bis.  The goal is to avoid a new offer/answer round. 

15. Changes Log 

   From draft-ietf-avt-rtp-svc-13 to draft-ietf-avt-rtp-svc-14 
    
   29 July - 1 August 2008: YkW 
    

 
 
Wenger, et al           Expires March 26, 2009                [Page 89] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

     - Updated the abstract to mention both new packetization modes 
        for MST and new NAL unit types. 

     - Restructured the document and addressed some major comments 
        asking for introductions of the new packetization modes and the 
        new NAL unit types in Section 1.   

     - Added the definition of dummy NAL unit in the definition 
        section (3.1). 

     - Added text for the NAL unit type extension mechanism.  

     - Added the description of payload structures in a new section 
        (4.3). 

     - Added the description of SST and MST transmission modes in a 
        new section (4.4). 

     - Added text explaining the handling of new NAL unit types for 
        SST in Section 4.5.1.  

     - Updated the description of MST packetization modes (4.5.2) with 
        all the tables changed and new tables added. 

     - Added description of single NAL unit packets in new section 
        (4.6). 

     - Updated the PACSI text (4.9) taking into account the use in NI-
        MTAP. 

     - Replaced the possibility of using NI-MTAP and PACSI with dummy 
        NAL units for decoder order recovery for NI-T and NI-TC 
        (5.2.1). 

     - Addressed all the minor comments Dave Singer sent to AVT 
        mailing list on 18 July 

     - Other minor changes throughout the document. 

     - Added some editing comments to point out new open issues. 

   21 August 2008: AE 
    
     - Editorial corrections throughout.  

     - Changed smart quotes to plain quotes everywhere. 
 
 
Wenger, et al           Expires March 26, 2009                [Page 90] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

     - Introduced DQid in 1.1.2, to avoid continuous references to 
        dependency_id*16+quality_id.  

     - The reference to "outside the same RTP packet stream" in the 
        beginning of 1.2.2 is confusing, as MST has not been introduced 
        yet. I reordered the paragraphs so that it is easier to follow, 
        and also made some changes that were necessary after that. 

     - In 4.2.1, renamed bit0, bit1, and bit2 to J, K, and L. Also 
        indicated that their semantics depend on the subtype - this was 
        the original proposal in Hannover. The idea is that, for each 
        subtype, you get 3 one-bit fields to use as flags, so that you 
        don't have to waste another byte. I changed the order so that 
        subtypes are indicated in increasing values. I indicate that 
        the entire NAL unit should be ignored if the ST is not 1 or 2. 
        I also changed the ordering of the fields to put the flags at 
        the end.  

     - For the Y bit, in 4.9, I changed "SHOULD be identical" to "MUST 
        be identical".  

     - In 5.1, changed SHOULD to MUST for the first bullet of "When 
        SSE is used" (MUST be encapsulated according to RFC 3984).  

     - Implemented corrections based on Peter Amon's feedback of 
        August 21, 2008. (Not all of them - suggestion to use H.264/AVC 
        in some places was not correct.) 

     - The worlds SHOULD/MUST in the introduction were changed to 
        small case, since they are not mandated by this memo but 
        another memo/specification. I originally just flagged this, but 
        decided to implement the change after seeing that Peter too 
        suggested this format. 

     27 August 2008, TS 

     - Added text in introduction and abstract giving an basic 
        overview on transmission modes and new packet structures. 

     - Changed Dummy NAL unit to Empty NAL unit 

     - Added text to "RTP Header Usage" section on setting M-bit for 
        NI-MTAP and on setting RTP timestamp for Empty NAL unit 

     - Extended NI-MTAP definitions, including header, DON-field, 
        PACSI and timestamp alignments 

 
 
Wenger, et al           Expires March 26, 2009                [Page 91] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

     - Added definition of Empty NAL unit 

     - Corrected tables in section section 4.3 4.5 

     - Added some text on NI-T mode in PACSI section 

     - Clarified text on "sprop-remux-buf-req" "remux-buf-cap" 

     - Added text to section 5.2.1 on the presence of SDP parameters 

     28 August - 1 September 2008, YkW 

     - Changed (targeting an improvement) in the abstract the 
        sentences for introduction of the four MST packetization modes, 
        and highlighted some places in the beginning paragraphs in the 
        introduction section that require improvements.  

     - Added the requirement of using RFC 3984 for the session 
        carrying an H.264/AVC compatible subset in MST. 

     - Clarified the text for RTP header usage, added timestamp 
        setting for single NAL unit packet containing a PACSI NAL unit, 
        and setting of SSRC for SST and MST. 

     - Made some changes to the new text defining NI-MTAP, and added 
        some comments for discussion.  

     - Added an informative note regarding where to put the SVC NAL 
        unit header extension bytes in fragments of an SVC NAL unit 
        with four-byte NAL unit header.  

     - Made some changes to the text defining empty NAL units. 

     - In section 6.1.2, added an informative note regarding the cases 
        wherein CS-DON values cannot be derived for some NAL units due 
        to some particular ways of packet losses.  

     - Corrected the semantics of mst-mode, sprop-mst-remux-buf-size 
        (which was sprop-mst-interleave-depth) and sprop-mst-max-don-
        diff with regard to the absence of mst-mode, and the semantics 
        of sprop-remux-buf-req, remux-buf-cap and sprop-remux-init-buf-
        time with regard to their presence. 

     - Added optional and declarative media type parameters sprop-mst-
        csdon-always-present, sprop-frame-rate, sprop-bit-rate, and 
        sprop-frame-rate.  

 
 
Wenger, et al           Expires March 26, 2009                [Page 92] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

     - Other editorial changes throughout the document, and removed a 
        few obsolete comments and editors' notes.   

     - Updated the open issues section.  

   5 - 25 September 2008, AE 

   General: reworked text removing all editorial correction 
   annotations, and leaving the text in the form that I think is the 
   best. You will notice that there are now very few Word edits, making 
   the text very clean, and what remained is mostly Word comments. All 
   [Ed.] entries now have Word comments. You can review outstanding 
   issues by browsing the comments. 

   At this point I suggest we NO LONGER make editorial corrections - 
   there has been some flip-flopping with changes. We need to stop in 
   order to finalize the memo. 

   The following identifies editorial changes that you should be aware 
   of. 

     - Reworked abstract and introduction. Note that it is no longer 
        allowed to signal the H264 media subtype for an SVC stream. 
        PLEASE DO NOT MAKE ANY FURTHER CHANGES unless you really want 
        to spend the time doing so.   
         
        This section also references the new 'avc-ready' signalling 
        parameter. Contrary to what was discussed in the 9/3/08 
        conference call, it's now an sprop, as discussed in the 
        Editor's call of 9/24/08. 

     - In 4.1, regarding the setting of the RTP timestamp in Empty NAL 
        units, I changed the text to require that the timestamp is set 
        according to 4.10, and I added text in 4.10 to require an 
        associated type 1, 5, or 20 NAL (from which to get the actual 
        time to use).  

     - Re-titled 4.2 to "NAL Unit Extension and Header Usage", from 
        "NAL Unit Header Extension and Usage". SVC already has an SVC  
        header extension, and this would be confusing. Plus we are not 
        extending the header, but the NAL unit type space.  

     - In Table 2, I opted for the word "reserved" rather than 
        "undefined", for NAL unit type 0. The same word should be used 
        in RFC3984bis (per YK's comment). 


 
 
Wenger, et al           Expires March 26, 2009                [Page 93] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

     - Reviewed Tables 4, 7, and 9 with the editors and changed some 
        wrong entries for the Empty NAL unit (it was disallowed in 
        Single NAL unit mode). 

     - Added new Table 4 to show the session packetization modes 
        allowed in SST. Pedantic, but we thought it's useful (all yes). 
        Also, 6.2.1.1 has wrong table number (7). It's now fixed (12). 

     - In 4.7.1, I specified that the J field in NI-MTAP must be 0 for 
        SST (no CS-DONs in SST).  

     - Fixed incorrect references to J field in NI-MTAP ("bit2", "L") 
        in 4.9 (PACSI). 

     - In 4.9, PACSI, changed the semantics of S and E flags to 
        indicate if the first and last NAL units are the first or last 
        NAL units of a layer representation. This is more useful. Also 
        updated informative note. Furthermore, I added informative note 
        text for TL0PICIDX to indicate how it is handled in NI-MTAP. 
        Finally, I disallowed this scheme for I-C by specifiing in 
        5.2.3 that the Y bit MUST be set to 0.  

     - I noticed that references to restrictions for Empty NAL, NI-
        MTPA, and PACSI are in several places. Even if they are all 
        correct, it may be dangerous or confusing. Maybe they should be 
        in only one place. In general, it's good if the normative words 
        MUST etc. appear in a single place for each rule. 

     - In 4.10, fixed subtype to be 1 instead of 2. 2 is the NI-MTAP. 
                         nd          - In 5.2.1, in the 2  way of creating NAL units for time 
        aligment, I say that you can transmit coded data that instructs 
        the decoder to repeat the previous picture. I also merged the 
        two back-to-back informative notes. 

     - 5.2.1 uses inconsistent identation between the first line, the 
        first bullet, and what follows after the informative note. It 
        is not clear if the text after the note is part of the bullet, 
        or it is top-level material. I removed the bullets as they did 
        not appear to be useful. 

     - The example in 5.2.1 was wrong. The notation was confusing, and 
        the time alignment appears to be wrong. Some of the notation 
        was also wrong (e.g., TS_B2 is shown in the figure but not used 
        in the text, whereas TS_B1 is NOT shown in the figure. Also, 
        A(TS_B4) should probably be P(TS_B3) or something. I rewrote 
        the example completely. 
 
 
Wenger, et al           Expires March 26, 2009                [Page 94] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

     - Added Section 6.1, De-Packetization Process for SST, so that it 
        shows in the ToC. Updated all references to original 6.1.*. 

     - In (new) 6.2.1, I removed the use of empty NI-MTAP and single 
        PACSI, since we now have the Empty NAL for the same purpose.  

     - Added reference to [Lennox] and informative note in 6.2.1 about 
        directly using TSs rather than first obtaining NTP values. 

     - The reordering example of Figure 6 now reads well. The only 
        problem is the need to establish "order of dependency". What if 
        there is AU data for a layer that is not part of the top 
        layer's dependency path? How will ths data get ordered. 
        Example: base A, enh B depends on A, enh C depends on A, and 
        target layer is C. You don't know where to put the B data, 
        before or after C. 

     - Changed all "SHALL" to "MUST". 

   26 September 2008, YkW 

     - In Abstract and Introduction, changed all "RTP timestamp 
        alignment" to "timestamp alignment". 

     - In Introduction, changed "The Empty NAL unit is used to ensure 
        inter-session RTP timestamp alignment in MST when temporal 
        scalability is used" to "The Empty NAL unit is used to ensure 
        inter-session timestamp alignment required for decoding order 
        recovery in MST", because use of temporal scalability may or 
        may not require the use of Empty NAL units.  

     - In introduction, changed the wording of "two new NAL unit 
        types" to "three new NAL unit types", to be consistent with the 
        Abstract, section 1.2.3, as well as other sections.  

     - In section 2 "conventions", changed back "SHALL" to "MUST" in 
        two places.  

     - In section 4.7.1, removed the first Word comment and the first 
        editing comment, which are obsolete. It is clearly said that, 
        when used in NI-C or NI-TC mode, the J field MUST be equal to 1 
        (i.e. the DON field is present). 

     - In section 4.9, avoided the wording "may not", which has been 
        considered most confusing wording by some :-) 


 
 
Wenger, et al           Expires March 26, 2009                [Page 95] 

Internet-Draft     RTP Payload Format for SVC Video      September 2008 
    

     - In section 4.11.1, added a bullet item on how CS-DON value is 
        "derived" for a non-PACSI NAL unit in an NI-MTAP packet, and 
        removed the comment. 

     - In section 5.1, removed the packetization rule "For a non-PACSI 
        NAL unit in an NI-MTAP packet, the CS-DON value is equal to the 
        value of the DON field of the non-interleaved multi-time 
        aggregation unit.", as it is redundant - it must be the case 
        anyway according to the PACSI semantics.  

     - In the last bullet item of section 5.2.2, added NI-MTAP, and 
        removed the comment.  

     - Some typo corrections here and there, and removed a few other 
        obsolete comments. 

     - Updated the list of open issues (basically removed all except 
        for the big one on signaling). 

    



























 
 
Wenger, et al           Expires March 26, 2009                [Page 96] 

